[
  {
    "id": "38b5bc2f-7827-46a7-9ed2-1a1cf5fd2cc8",
    "name": "Bugbear",
    "source": "Mordenkainen Presents: Monsters of the Multiverse",
    "description": "Despite their formidable build, bugbears are quiet skulkers, thanks to a fey magic that allows them to hide in spaces seemingly too small for them.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/bugbear/bugbear.webp",
    "creature_type": "Humanoid. You are also considered a goblinoid for any prerequisite or effect that requires you to be a goblinoid.",
    "size": "Medium",
    "speed": "30 feet",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/bugbear/bugbear_main.png",
    "traits": [
      "Darkvision",
      "Fey Ancestry",
      "Long-Limbed",
      "Powerful Build",
      "Sneaky",
      "Surprise Attack"
    ],
    "details": [
      {
        "type": "description",
        "content": "Neither bugs nor bears, bugbears are the hulking cousins of goblins and hobgoblins. With roots in the Feywild, early bugbears resided in hidden places, in hard-to-reach and shadowed spaces. Long ago and from out of the corner of your eye, they came to the Material Plane, urged to spread throughout the multiverse by the conquering god Maglubiyet. Centuries later, they still bear a fey gift for lurking just out of sight, and many of them have sneaked away from that god's influence.\n\nThey are long of limb and covered in coarse hair, with wedge-shaped ears and pointed teeth. Despite their formidable build, bugbears are quiet skulkers, thanks to a fey magic that allows them to hide in spaces seemingly too small for them."
      }
    ],
    "features": [
      {
        "title": "Darkvision",
        "description": "You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
      },
      {
        "title": "Fey Ancestry",
        "description": "You have advantage on saving throws you make to avoid or end the charmed condition on yourself."
      },
      {
        "title": "Long-Limbed",
        "description": "When you make a melee attack on your turn, your reach for it is 5 feet greater than normal."
      },
      {
        "title": "Powerful Build",
        "description": "You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift."
      },
      {
        "title": "Sneaky",
        "description": "You are proficient in the Stealth skill. In addition, without squeezing, you can move through and stop in a space large enough for a Small creature."
      },
      {
        "title": "Surprise Attack",
        "description": "If you hit a creature with an attack roll, the creature takes an extra 2d6 damage if it hasn't taken a turn yet in the current combat."
      }
    ],
    "created_at": "2025-10-23T07:54:30.121+00:00",
    "key": "bugbear",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "ffeb28d3-8129-4bb7-a81a-16d58ff35efa",
    "name": "Centaur",
    "source": "Mordenkainen Presents: Monsters of the Multiverse",
    "description": "Centaurs gallop throughout the multiverse and trace their origins to many different realms.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/centaur/centaur.webp",
    "creature_type": "Fey",
    "size": "Medium",
    "speed": "40 feet",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/centaur/centaur_main.png",
    "traits": [
      "Charge",
      "Equine Build",
      "Hooves",
      "Natural Affinity"
    ],
    "details": [
      {
        "type": "description",
        "content": "Centaurs gallop throughout the multiverse and trace their origins to many different realms. The centaurs presented here hail from the Feywild and mystically resonate with the natural world. From the waist up, they resemble elves, displaying all the elf varieties of skin tone. From the waist down, they have the bodies of horses."
      }
    ],
    "features": [
      {
        "title": "Charge",
        "description": "If you move at least 30 feet straight toward a target and then hit it with a melee weapon attack on the same turn, you can immediately follow that attack with a bonus action, making one attack against the target with your hooves."
      },
      {
        "title": "Equine Build",
        "description": "You count as one size larger when determining your carrying capacity and the weight you can push or drag.\n\nIn addition, any climb that requires hands and feet is especially difficult for you because of your equine legs. When you make such a climb, each foot of movement costs you 4 extra feet instead of the normal 1 extra foot."
      },
      {
        "title": "Hooves",
        "description": "You have hooves that you can use to make unarmed strikes. When you hit with them, the strike deals 1d6 + your Strength modifier bludgeoning damage, instead of the bludgeoning damage normal for an unarmed strike."
      },
      {
        "title": "Natural Affinity",
        "description": "Your fey connection to nature gives you an intuitive connection to the natural world and the animals within it. You therefore have proficiency in one of the following skills of your choice: Animal Handling, Medicine, Nature, or Survival."
      }
    ],
    "created_at": "2025-10-23T07:54:30.594+00:00",
    "key": "centaur",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "73805f8a-62dd-48db-9999-f70155108ec3",
    "name": "Changeling",
    "source": "Mordenkainen Presents: Monsters of the Multiverse",
    "description": "For some changelings, a new face is only a disguise. For other changelings, a new face may reveal an aspect of their soul.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/changeling/changeling.webp",
    "creature_type": "Fey",
    "size": "Small or Medium",
    "speed": "30 feet",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/changeling/changeling_main.png",
    "traits": [
      "Changeling Instincts",
      "Shapechanger"
    ],
    "details": [
      {
        "type": "description",
        "content": "With ever-changing appearances, changelings reside in many societies undetected. Each changeling can supernaturally adopt any face they like. For some changelings, a new face is only a disguise. For other changelings, a new face may reveal an aspect of their soul.\n\nThe first changelings in the multiverse appeared in the Feywild, and the wondrous, mutable essence of that plane lingers in changelings today—even in those changelings who have never set foot in the fey realm. Each changeling decides how to use their shape-shifting ability, channeling either the peril or the joy of the Feywild. Sometimes they adopt new forms for the sake of mischief or malice, and other times they don a new identity to right wrongs or delight the downtrodden.\n\nIn their true form, changelings appear faded, their features almost devoid of detail. It is rare to see a changeling in that form, for a typical changeling changes their shape the way others might change clothes. A casual shape—one created on the spur of the moment, with no depth or history—is called a mask. A mask can be used to express a mood or to serve a specific purpose and then might never be used again. However, many changelings develop identities that have more depth, crafting whole personas complete with histories and beliefs. A changeling adventurer might have personas for many situations, including negotiation, investigation, and combat.\n\nPersonas can be shared by multiple changelings; a community might be home to three healer changelings, with whoever is on duty adopting the persona of Andrea, the gentle physician. Personas can even be passed down through a family, allowing a younger changeling to take advantage of contacts established by the persona's previous users."
      }
    ],
    "features": [
      {
        "title": "Changeling Instincts",
        "description": "Thanks to your connection to the fey realm, you gain proficiency with two of the following skills of your choice: Deception, Insight, Intimidation, Performance, or Persuasion."
      },
      {
        "title": "Shapechanger",
        "description": "As an action, you change your appearance and your voice. You determine the specifics of the changes, including your coloration, hair length, and sex. You can also adjust your height between Medium and Small. You can make yourself appear as a member of another race, though none of your game statistics change. You can't duplicate the appearance of an individual you've never seen, and you must adopt a form that has the same basic arrangement of limbs that you have. Your clothing and equipment aren't changed by this trait.\n\nYou stay in the new form until you use an action to revert to your true form or until you die."
      }
    ],
    "created_at": "2025-10-23T07:54:31.062+00:00",
    "key": "changeling",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "5cb88dae-1431-4e42-b7fc-10d8ece399aa",
    "name": "Deep Gnome",
    "source": "Mordenkainen Presents: Monsters of the Multiverse",
    "description": "Deep gnomes, or svirfneblin, are natives of the Underdark and are suffused with that subterranean realm’s magic.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/deep_gnome/deep_gnome.webp",
    "creature_type": "Humanoid",
    "size": "Small",
    "speed": "30 feet",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/deep_gnome/deep_gnome_main.png",
    "traits": [
      "Darkvision",
      "Gift of the Svirfneblin",
      "Gnomish Magic Resistance",
      "Svirfneblin Camouflage"
    ],
    "details": [
      {
        "type": "description",
        "content": "Deep gnomes, or svirfneblin, are natives of the Underdark and are suffused with that subterranean realm's magic. They can supernaturally camouflage themselves, and their svirfneblin magic renders them difficult to locate. These abilities have enabled them to survive for generations among the perils of the Underdark.\n\nLike other gnomes, deep gnomes can live for centuries, up to 500 years.\n\n"
      }
    ],
    "features": [
      {
        "title": "Darkvision",
        "description": "You can see in dim light within 120 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
      },
      {
        "title": "Gift of the Svirfneblin",
        "description": "Starting at 3rd level, you can cast the disguise self spell with this trait. Starting at 5th level, you can also cast the nondetection spell with it, without requiring a material component. Once you cast either of these spells with this trait, you can't cast that spell with it again until you finish a long rest. You can also cast these using spell slots you have of the appropriate level.\n\nIntelligence, Wisdom, or Charisma is your spellcasting ability for these spells when you cast them with this trait (choose when you select this race)."
      },
      {
        "title": "Gnomish Magic Resistance",
        "description": "You have advantage on Intelligence, Wisdom, and Charisma saving throws against spells."
      },
      {
        "title": "Svirfneblin Camouflage",
        "description": "When you make a Dexterity (Stealth) check, you can make the check with advantage. You can use this trait a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
      }
    ],
    "created_at": "2025-10-23T07:54:31.525+00:00",
    "key": "deep_gnome",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "a3c70a20-4970-4e22-866f-495ea7c4cd08",
    "name": "Dhampir",
    "source": "Van Richten’s Guide to Ravenloft",
    "description": "Poised between the worlds of the living and the dead, dhampirs retain their grip on life yet are endlessly tested by vicious hungers.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/dhampir/dhampir.webp",
    "creature_type": "Humanoid",
    "size": "You are Medium or Small. You choose the size when you gain this lineage.",
    "speed": "35 feet.",
    "asi": "Increase one ability score by 2 and two other scores by 1, or increase three different scores by 1.",
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/dhampir/dhampir_main.png",
    "traits": [
      "Ancestral Legacy",
      "Darkvision",
      "Deathless Nature",
      "Spider Climb",
      "Vampiric Bite"
    ],
    "details": [
      {
        "type": "description",
        "content": "Poised between the worlds of the living and the dead, dhampirs retain their grip on life yet are endlessly tested by vicious hungers. Their ties to the undead grant dhampirs a taste of a vampire’s deathless prowess in the form of increased speed, darkvision, and a life-draining bite.\n\nWith unique insights into the nature of the undead, many dhampirs become adventurers and monster hunters. Their reasons are often deeply personal. Some seek danger, imagining monsters as personifications of their own hungers. Others pursue revenge against whatever turned them into a dhampir. And still others embrace the solitude of the hunt, striving to distance themselves from those who’d tempt their hunger."
      },
      {
        "type": "description",
        "content": "<b>Dhampir Hungers :</b>\nEvery dhampir knows a thirst slaked only by the living. Those who overindulge their thirst risk losing control and forever viewing others as prey. Those who resist might find exceptional ways of controlling their urges or suppress them through constant, molar-grinding restraint. In any case, temptation haunts dhampirs, and circumstances conspire to give them endless reasons to indulge.\n\nWhile many dhampirs thirst for blood, your character might otherwise gain sustenance from the living. Roll on or choose an option from the Dhampir Hungers table to determine what tempts your character to feed."
      },
      {
        "type": "table",
        "table": {
          "rows": [
            [
              "1",
              "Blood"
            ],
            [
              "2",
              "Flesh or raw meat"
            ],
            [
              "3",
              "Cerebral spinal fluid"
            ],
            [
              "4",
              "Psychic energy"
            ],
            [
              "5",
              "Dreams/Memory"
            ],
            [
              "6",
              "Life energy"
            ]
          ],
          "headers": [
            "d6",
            "Hunger"
          ]
        },
        "content": ""
      },
      {
        "type": "description",
        "content": "<b>Dhampir Origins :</b>\nDhampirs often arise from encounters with vampires, but all manner of macabre bargains, necromantic influences, and encounters with mysterious immortals might have transformed your character. The Dhampir Origins table provides suggestions for how your character gained their lineage."
      },
      {
        "type": "table",
        "table": {
          "rows": [
            [
              "1",
              "You are the reincarnation of an ancestor who was a vampiric tyrant."
            ],
            [
              "2",
              "Your pact with a predatory deity, fiend, fey, or spirit causes you to share their hunger."
            ],
            [
              "3",
              "You survived being attacked by a vampire but were forever changed."
            ],
            [
              "4",
              "A parasite lives inside you. You indulge its hunger."
            ],
            [
              "5",
              "Tragedy interrupted your transformation into an immortal."
            ],
            [
              "6",
              "You are a diminished form of an otherworldly being. Slaking your hunger hastens your renewal."
            ],
            [
              "7",
              "One of your parents was a vampire."
            ],
            [
              "8",
              "A radical experiment changed your body, making you reliant on others for vital fluids."
            ]
          ],
          "headers": [
            "D8",
            "Origin"
          ]
        },
        "content": ""
      }
    ],
    "features": [
      {
        "title": "Ancestral Legacy",
        "description": "If you replace a race with this lineage, you can keep the following elements of that race: any skill proficiencies you gained from it and any climbing, flying, or swimming speed you gained from it.\n\nIf you don’t keep any of those elements or you choose this lineage at character creation, you gain proficiency in two skills of your choice."
      },
      {
        "title": "Darkvision",
        "description": "You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness as shades of gray."
      },
      {
        "title": "Deathless Nature",
        "description": "You don’t need to breathe."
      },
      {
        "title": "Spider Climb",
        "description": "You have a climbing speed equal to your walking speed. In addition, at 3rd level, you can move up, down, and across vertical surfaces and upside down along ceilings, while leaving your hands free."
      },
      {
        "list": [
          "You regain hit points equal to the piercing damage dealt by the bite.",
          "You gain a bonus to the next ability check or attack roll you make; the bonus equals the piercing damage dealt by the bite."
        ],
        "title": "Vampiric Bite",
        "description": "Your fanged bite is a natural weapon, which counts as a simple melee weapon with which you are proficient. You add your Constitution modifier, instead of your Strength modifier, to the attack and damage rolls when you attack with this bite. It deals 1d4 piercing damage on a hit. While you are missing half or more of your hit points, you have advantage on attack rolls you make with this bite.\n\nYou can empower yourself with this bite a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.\n\nWhen you attack with this bite and hit a creature that isn’t a Construct or an Undead, you can empower yourself in one of the following ways of your choice:"
      }
    ],
    "created_at": "2025-10-23T07:54:32.354+00:00",
    "key": "dhampir",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "c770f602-457a-4b78-9282-366589e844f0",
    "name": "Disembodied",
    "source": "Grim Hollow: Player’s Guide",
    "description": "Most Disembodied retain a touch of the ethereal magic that marks them as creatures of two worlds",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/disembodied/disembodied.webp",
    "creature_type": "Humanoid",
    "size": "Your size is Small or Medium, as you determine.",
    "speed": "30 feet.",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/disembodied/disembodied_main.png",
    "traits": [
      "Magical Fortification",
      "Master of Distraction",
      "Out of Phase",
      "Ethereal Fade",
      "Inured to the Elements",
      "Magical Insight",
      "Magical Savvy",
      "Magical Savant"
    ],
    "details": [
      {
        "type": "description",
        "content": "To allow one’s mind to touch the planes is the ultimate dream of many an arcane spellcaster, and nowhere has that dream come closer to reality than in the lost city of Ulmyr’s Gate. Founded in the Bürach Empire by a group of ambitious wizards who chafed under the limitations imposed upon them by government bureaucracy, Ulmyr’s Gate boasted free study for all mages who sought sanctuary within its walls. The Great College dedicated to magical study in the city quickly became a sanctum for mages of all disciplines from across Etharis, creating a golden age of magic within its walls.\n\nThat golden age came crashing down in a single night, when the founding mages of Ulmyr’s Gate attempted an ambitious ritual intended to part the veil and create a permanent portal to the Ethereal Plane. Instead, their magic tore a gaping rift in the fabric of reality, and in an instant the entire city was tipped into the void between worlds. Ulmyr’s Gate and all its citizens were presumed destroyed. The incident triggered another inquisition against hubristic arcanists who tampered in things mortals were not meant to know. Then, life in the empire went on.\n\nYears later, stories began to surface of frightening apparitions sighted in the region where Ulmyr’s Gate once stood. These haunting folk seemed oddly blurred or indistinct. Witnesses reporting that they would vanish as suddenly as they appeared. Gradually, it became clear that these poor souls were the survivors of the Ethereal Rift, now trapped between worlds and trying to retain their tenuous grasp on the Material Plane.\n\nThose residents of lost Ulmyr’s Gate who have mustered the strength to return to the world have been named the disembodied by the sages who have studied them. These rare individuals have left or fled their former home, crossing through the Ethereal Rift to roam the mortal world. Though they resemble the people they once were, they are both more and less—creatures of two realms, often haunted by memories of the city’s destruction, of which they rarely if ever speak."
      }
    ],
    "features": [
      {
        "title": "Magical Fortification",
        "description": "The more that magic threatens you, the more your resilience to it increases. Choose an ability score: Strength, Dexterity, Constitution, Intelligence, Wisdom, or Charisma. You have Advantage on saving throws using that ability score against spells and other magical effects."
      },
      {
        "title": "Master of Distraction",
        "description": "You draw your foes’ attention to you, intending it to be the last diversion they ever see. As an Influence action, you put on a tactical display (bravado, cowardice, confusion, or some other tactic) that gets your enemies’ attention. Until the end of your next turn, any attack on an enemy within 10 feet of you that could see you when you took the Influence action, is made with Advantage. You can use this feature a number of times equal to your Proficiency Bonus, regaining all expended uses when you finish a Long Rest."
      },
      {
        "title": "Out of Phase",
        "description": "Your corporeal presence shifts and fades, softening your enemies’ ability to harm you. As a Bonus Action, for 1 minute, all creatures have Disadvantage on attack rolls against you, and you can move through other creature’s spaces without treating them as Difficult Terrain. You can use this feature a number of times equal to your Proficiency Bonus, regaining all expended uses when you finish a Long Rest."
      },
      {
        "title": "Ethereal Fade",
        "description": "Shifting away from the mortal world lets you move through and observe that world unseen. As a Magic action, you fade from the Material Plane into the Ethereal Plane for 1 minute. While you remain in this state, you can’t interact with the Material Plane, and effects on the Material Plane can’t affect you, including spells and creatures. You can move and hear as normal, and you see everything in shades of gray. When the effect ends, you reappear in the Material Plane in the closest unoccupied space to where you faded from. You can end the effect early as a Bonus Action. You regain the use of this feature again when you finish a Long Rest."
      },
      {
        "title": "Inured to the Elements",
        "description": "Even beneath scorching sun and in freezing cold, you hold yourself strong. You have Advantage on Constitution saving throws made to resist the effects of extreme cold or extreme heat."
      },
      {
        "title": "Magical Insight",
        "description": "Magic is power in the right hands, and those hands are yours. You have proficiency in the Arcana skill."
      },
      {
        "title": "Magical Savvy",
        "description": "Whether through intensive study or the innate touch of magic in your blood, you have the ability to invoke magical spells. You learn the Dancing Lights cantrip, which you cast using the associated ability score: Intelligence for Wizard spells, Wisdom for Cleric and Druid spells, and Charisma for Bard, Sorcerer, and Warlock spells. If the spell appears on multiple spell lists, choose one to determine the spellcasting attribute for that spell."
      },
      {
        "title": "Magical Savant",
        "description": "You learn the Level 1 spell Feather Fall. You can cast it once without expending a spell slot, and you regain the ability to cast it in that way when you finish a Long Rest. If you have levels in the associated spellcasting class, you always have this spell prepared, and it doesn’t count against the number of spells you can prepare each day."
      }
    ],
    "created_at": "2025-10-23T07:54:32.835+00:00",
    "key": "disembodied",
    "homebrew": true,
    "homebrew_id": ""
  },
  {
    "id": "903c4855-941e-42d7-9708-b7c01be73972",
    "name": "Dragonborn",
    "source": "Player's Handbook",
    "description": "The ancestors of dragonborn hatched from the eggs of chromatic and metallic dragons.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/dragonborn/dragonborn.webp",
    "creature_type": "Humanoid",
    "size": "Medium (about 5–7 feet tall)",
    "speed": "30 feet",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/dragonborn/dragonborn_main.webp",
    "traits": [
      "Dragon Ancestry",
      "Breath Weapon",
      "Damage Resistance",
      "Darkvision",
      "Draconic Flight"
    ],
    "details": [
      {
        "type": "description",
        "content": "The ancestors of dragonborn hatched from the eggs of chromatic and metallic dragons. One story holds that these eggs were blessed by the dragon gods Bahamut and Tiamat, who wanted to populate the multiverse with people created in their image. Another story claims that dragons created the first dragonborn without the gods’ blessings. Whatever their origin, dragonborn have made homes for themselves on the Material Plane.\n\nDragonborn look like wingless, bipedal dragons—scaly, bright-eyed, and thick-boned with horns on their heads—and their coloration and other features are reminiscent of their draconic ancestors."
      }
    ],
    "features": [
      {
        "table": {
          "rows": [
            [
              "Black",
              "Acid"
            ],
            [
              "Blue",
              "Lightning"
            ],
            [
              "Brass",
              "Fire"
            ],
            [
              "Bronze",
              "Lightning"
            ],
            [
              "Copper",
              "Acid"
            ],
            [
              "Gold",
              "Fire"
            ],
            [
              "Green",
              "Poison"
            ],
            [
              "Red",
              "Fire"
            ],
            [
              "Silver",
              "Cold"
            ],
            [
              "White",
              "Cold"
            ]
          ],
          "headers": [
            "Dragon",
            "Damage Type"
          ]
        },
        "title": "Draconic Ancestry",
        "description": "Your lineage stems from a dragon progenitor. Choose the kind of dragon from the Draconic Ancestors table. Your choice affects your Breath Weapon and Damage Resistance traits as well as your appearance."
      },
      {
        "title": "Breath Weapon",
        "description": "When you take the Attack action on your turn, you can replace one of your attacks with an exhalation of magical energy in either a 15-foot Cone or a 30-foot Line that is 5 feet wide (choose the shape each time). Each creature in that area must make a Dexterity saving throw (DC 8 + Constitution modifier + Proficiency Bonus). On a failed save, a creature takes 1d10 damage of the type determined by your Draconic Ancestry trait. On a successful save, it takes half as much damage. Damage increases by 1d10 at levels 5 (2d10), 11 (3d10), and 17 (4d10). You can use this Breath Weapon a number of times equal to your Proficiency Bonus, regaining all expended uses when you finish a Long Rest."
      },
      {
        "title": "Damage Resistance",
        "description": "You have Resistance to the damage type determined by your Draconic Ancestry trait."
      },
      {
        "title": "Darkvision",
        "description": "You have Darkvision with a range of 60 feet."
      },
      {
        "title": "Draconic Flight",
        "description": "At level 5, you can channel draconic magic to give yourself temporary flight. As a Bonus Action, you sprout spectral wings for 10 minutes or until you retract them or are Incapacitated. During that time, you have a Fly Speed equal to your Speed. Your wings appear to be made of the same energy as your Breath Weapon. Once used, this can’t be used again until you finish a Long Rest."
      }
    ],
    "created_at": "2025-10-23T07:54:33.305+00:00",
    "key": "dragonborn",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "c8d70eb7-4814-49f9-80f8-b7ac1d81903f",
    "name": "Duergar",
    "source": "Mordenkainen Presents: Monsters of the Multiverse",
    "description": "Duergar are dwarves whose ancestors were transformed by centuries living in the deepest places of the Underdark.\r\n",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/duergar/duergar.webp",
    "creature_type": "Humanoid",
    "size": "Medium",
    "speed": "30 feet",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/duergar/duergar_main.png",
    "traits": [
      "Dwarf",
      "Darkvision",
      "Duergar Magic",
      "Dwarven Resilience",
      "Psionic Fortitude"
    ],
    "details": [
      {
        "type": "description",
        "content": "Duergar are dwarves whose ancestors were transformed by centuries living in the deepest places of the Underdark. That chthonic realm is saturated with strange magical energy, and over generations, early duergar absorbed traces of it. They were further altered when mind flayers and other Aberrations invaded and performed horrific experiments on them. Fueled by Underdark magic, those experiments left early duergar with psionic powers, which have been passed down to their descendants. In time, they liberated themselves from their aberrant tyrants and forged a new life for themselves in the Underdark and beyond.\n\nLike other dwarves, duergar typically have a life span of 350 years."
      }
    ],
    "features": [
      {
        "title": "Dwarf",
        "description": "You are also considered a dwarf for any prerequisite or effect that requires you to be a dwarf."
      },
      {
        "title": "Darkvision",
        "description": "You can see in dim light within 120 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
      },
      {
        "title": "Duergar Magic",
        "description": "Starting at 3rd level, you can cast the enlarge/reduce spell on yourself with this trait, without requiring a material component. Starting at 5th level, you can also cast the invisibility spell on yourself with this trait, without requiring a material component. Once you cast either of these spells with this trait, you can't cast that spell with it again until you finish a long rest. You can also cast these spells using spell slots you have of the appropriate level.\n\nIntelligence, Wisdom, or Charisma is your spellcasting ability for these spells when you cast them with this trait (choose when you select this race)."
      },
      {
        "title": "Dwarven Resilience",
        "description": "You have advantage on saving throws you make to avoid or end the poisoned condition on yourself. You also have resistance to poison damage."
      },
      {
        "title": "Psionic Fortitude",
        "description": "You have advantage on saving throws you make to avoid or end the charmed or stunned condition on yourself."
      }
    ],
    "created_at": "2025-10-23T07:54:33.781+00:00",
    "key": "duergar",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "2f4b48a7-581c-49af-8012-acdf3e1ad0ce",
    "name": "Dwarf",
    "source": "Player’s Handbook",
    "description": "Dwarves were raised from the earth in the elder days by a deity of the forge.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/dwarf/dwarf.webp",
    "creature_type": "Humanoid",
    "size": "Medium (about 4-5 feet tall)",
    "speed": "30 feet",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/dwarf/dwarf_main.png",
    "traits": [
      "Darkvision",
      "Dwarven Resilience",
      "Dwarven Toughness",
      "Stonecunning"
    ],
    "details": [
      {
        "type": "description",
        "content": "Dwarves were raised from the earth in the elder days by a deity of the forge. Called by various names on different worlds—Moradin, Reorx, and others—that god gave dwarves an affinity for stone and metal and for living underground. The god also made them resilient like the mountains, with a life span of about 350 years.\n\nSquat and often bearded, the original dwarves carved cities and strongholds into mountainsides and under the earth. Their oldest legends tell of conflicts with the monsters of mountaintops and the Underdark, whether those monsters were towering giants or subterranean horrors. Inspired by those tales, dwarves of any culture often sing of valorous deeds—especially of the little overcoming the mighty.\n\nOn some worlds in the multiverse, the first settlements of dwarves were built in hills or mountains, and the families who trace their ancestry to those settlements call themselves hill dwarves or mountain dwarves, respectively. The Greyhawk and Dragonlance settings have such communities."
      }
    ],
    "features": [
      {
        "title": "Darkvision",
        "description": "You have Darkvision with a range of 120 feet."
      },
      {
        "title": "Dwarven Resilience",
        "description": "You have Resistance to Poison damage. You also have Advantage on saving throws you make to avoid or end the Poisoned condition."
      },
      {
        "title": "Dwarven Toughness",
        "description": "Your Hit Point maximum increases by 1, and it increases by 1 again whenever you gain a level."
      },
      {
        "title": "Stonecunning",
        "description": "As a Bonus Action, you gain Tremorsense with a range of 60 feet for 10 minutes. You must be on a stone surface or touching a stone surface to use this Tremorsense. The stone can be natural or worked.\n\nYou can use this Bonus Action a number of times equal to your Proficiency Bonus, and you regain all expended uses when you finish a Long Rest."
      }
    ],
    "created_at": "2025-10-23T07:54:34.241+00:00",
    "key": "dwarf",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "c99a9b54-b240-484b-b964-09eb799dd6d7",
    "name": "Earth Genasi",
    "source": "Mordenkainen Presents: Monsters of the Multiverse",
    "description": "Tracing their ancestry to dao, the genies of the Elemental Plane of Earth, earth genasi inherit dao’s steadfast strength and control over earth.\r\n",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/earth_genasi/earth_genasi.webp",
    "creature_type": "Humanoid",
    "size": "Small or Medium",
    "speed": "30 feet",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/earth_genasi/earth_genasi_main.png",
    "traits": [
      "Darkvision",
      "Earth Walk",
      "Merge with Stone"
    ],
    "details": [
      {
        "type": "description",
        "content": "Tracing their ancestry to the genies of the Elemental Planes, each genasi can tap into the power of one of the elements. Air, earth, fire, and water—these are the four pillars of the Material Plane and the four types of genasi. Some genasi are direct descendants of a genie, while others were born to non-genasi parents who lived near a place suffused by a genie's magic.\n\nA typical genasi has a life span of 120 years."
      }
    ],
    "features": [
      {
        "title": "Darkvision",
        "description": "You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
      },
      {
        "title": "Earth Walk",
        "description": "You can move across difficult terrain without expending extra movement if you are using your walking speed on the ground or a floor."
      },
      {
        "title": "Merge with Stone",
        "description": "You know the blade ward cantrip. You can cast it as normal, and you can also cast it as a bonus action a number of times equal to your proficiency bonus, regaining all expended uses when you finish a long rest.\n\nStarting at 5th level, you can cast the pass without trace spell with this trait, without requiring a material component. Once you cast that spell with this trait, you can't do so again until you finish a long rest. You can also cast it using any spell slots you have of 2nd level or higher.\n\nIntelligence, Wisdom, or Charisma is your spellcasting ability for these spells when you cast them with this trait (choose when you select this race)."
      }
    ],
    "created_at": "2025-10-23T07:54:35.074+00:00",
    "key": "earth_genasi",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "72f48d4d-e5ae-45ab-bc10-4766a85bac9d",
    "name": "Eladrin",
    "source": "Mordenkainen Presents: Monsters of the Multiverse",
    "description": "Eladrin are elves of the Feywild, a realm of perilous beauty and boundless magic.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/eladrin/eladrin.webp",
    "creature_type": "Humanoid",
    "size": "Medium",
    "speed": "30 feet",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/eladrin/eladrin_main.png",
    "traits": [
      "Darkvision",
      "Fey Ancestry",
      "Fey Step",
      "Keen Senses",
      "Trance"
    ],
    "details": [
      {
        "type": "description",
        "content": "Eladrin are elves of the Feywild, a realm of perilous beauty and boundless magic. Using that magic, eladrin can step from one place to another in the blink of an eye, and each eladrin resonates with emotions captured in the Feywild in the form of seasons—affinities that affect the eladrin's mood and appearance. An eladrin's season can change, though some remain in one season forever. Choose your season or roll on the Eladrin Seasons table. Your Trance trait lets you change your season.\n\nLike other elves, eladrin can live to be over 750 years old.\n\nEladrin Seasons"
      },
      {
        "type": "table",
        "table": {
          "rows": [
            [
              "1",
              "Autumn: peace and goodwill, when summer's harvest is shared with all."
            ],
            [
              "2",
              "Winter: contemplation and dolor, when the vibrant energy of the world slumbers."
            ],
            [
              "3",
              "Spring: cheerfulness and celebration, marked by merriment and hope as winter's sorrow passes."
            ],
            [
              "4",
              "Summer: boldness and aggression, a time of unfettered energy and calls to action."
            ]
          ],
          "headers": [
            "d4",
            "Season"
          ]
        },
        "content": ""
      }
    ],
    "features": [
      {
        "title": "Darkvision",
        "description": "You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
      },
      {
        "title": "Fey Ancestry",
        "description": "You have advantage on saving throws you make to avoid or end the charmed condition on yourself."
      },
      {
        "list": [
          "Autumn. Immediately after you use your Fey Step, up to two creatures of your choice that you can see within 10 feet of you must succeed on a Wisdom saving throw or be charmed by you for 1 minute, or until you or your companions deal any damage to the creatures.",
          "Winter. When you use your Fey Step, one creature of your choice that you can see within 5 feet of you before you teleport must succeed on a Wisdom saving throw or be frightened of you until the end of your next turn.",
          "Spring. When you use your Fey Step, you can touch one willing creature within 5 feet of you. That creature then teleports instead of you, appearing in an unoccupied space of your choice that you can see within 30 feet of you.",
          "Summer. Immediately after you use your Fey Step, each creature of your choice that you can see within 5 feet of you takes fire damage equal to your proficiency bonus."
        ],
        "title": "Fey Step",
        "description": "As a bonus action, you can magically teleport up to 30 feet to an unoccupied space you can see. You can use this trait a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.\n\nWhen you reach 3rd level, your Fey Step gain an additional effect based on your season; if the effect requires a saving throw, the DC equals 8 + your proficiency bonus + your Intelligence, Wisdom, or Charisma modifier (choose when you select this race):"
      },
      {
        "title": "Keen Senses",
        "description": "You have proficiency in the Perception skill."
      },
      {
        "title": "Trance",
        "description": "You don't need to sleep, and magic can't put you to sleep. You can finish a long rest in 4 hours if you spend those hours in a trancelike meditation, during which you retain consciousness.\n\nWhenever you finish this trance, you can change your season, and you can gain two proficiencies that you don't have, each one with a weapon or a tool of your choice selected from the Player's Handbook. You mystically acquire these proficiencies by drawing them from shared elven memory, and you retain them until you finish your next long rest."
      }
    ],
    "created_at": "2025-10-23T07:54:35.66+00:00",
    "key": "eladrin",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "9c6ec477-11bc-4124-9e14-e27d6de9a85d",
    "name": "Elf",
    "source": "Player's Handbook",
    "description": "The elves’ curiosity led many of them to explore other planes of existence.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/elf/elf.webp",
    "creature_type": "Humanoid",
    "size": "Medium (about 5–6 feet tall)",
    "speed": "30 feet",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/elf/elf_main.webp",
    "traits": [
      "Darkvision",
      "Elven Lineage",
      "Fey Ancestry",
      "Keen Senses",
      "Trance"
    ],
    "details": [
      {
        "type": "description",
        "content": "Created by the god Corellon, the first elves could change their forms at will. They lost this ability when Corellon cursed them for plotting with the deity Lolth, who tried and failed to usurp Corellon’s dominion. When Lolth was cast into the Abyss, most elves renounced her and earned Corellon’s forgiveness, but that which Corellon had taken from them was lost forever.\n\nNo longer able to shape-shift at will, the elves retreated to the Feywild, where their sorrow was deepened by that plane’s influence. Over time, curiosity led many of them to explore other planes of existence, including worlds in the Material Plane.\n\nElves have pointed ears and lack facial and body hair. They live for around 750 years, and they don’t sleep but instead enter a trance when they need to rest. In that state, they remain aware of their surroundings while immersing themselves in memories and meditations.\n\nAn environment subtly transforms elves after they inhabit it for a millennium or more, and it grants them certain kinds of magic. Drow, high elves, and wood elves are examples of elves who have been transformed thus."
      }
    ],
    "features": [
      {
        "title": "Darkvision",
        "description": "As an Elf, you have these special traits."
      },
      {
        "table": {
          "rows": [
            [
              "Drow",
              "The range of your Darkvision increases to 120 feet. You also know the Dancing Lights cantrip.",
              "Faerie Fire",
              "Darkness"
            ],
            [
              "High Elf",
              "You know the Prestidigitation cantrip. Whenever you finish a Long Rest, you can replace that cantrip with a different cantrip from the Wizard spell list.",
              "Detect Magic",
              "Misty Step"
            ],
            [
              "Wood Elf",
              "Your Speed increases to 35 feet. You also know the Druidcraft cantrip.",
              "Longstrider",
              "Pass without Trace"
            ]
          ],
          "headers": [
            "Lineage",
            "Level 1",
            "Level 3",
            "Level 5"
          ]
        },
        "title": "Elven Lineage",
        "description": "You are part of a lineage that grants you supernatural abilities. Choose a lineage from the Elven Lineages table. You gain the level 1 benefit of that lineage.\n\nWhen you reach character levels 3 and 5, you learn a higher-level spell, as shown on the table. You always have that spell prepared. You can cast it once without a spell slot, and you regain the ability to cast it in that way when you finish a Long Rest. You can also cast the spell using any spell slots you have of the appropriate level.\n\nIntelligence, Wisdom, or Charisma is your spellcasting ability for the spells you cast with this trait (choose the ability when you select the lineage)."
      },
      {
        "title": "Fey Ancestry",
        "description": "You have Advantage on saving throws you make to avoid or end the Charmed condition."
      },
      {
        "title": "Keen Senses",
        "description": "You have proficiency in the Insight, Perception, or Survival skill."
      },
      {
        "title": "Trance",
        "description": "You don’t need to sleep, and magic can’t put you to sleep. You can finish a Long Rest in 4 hours if you spend those hours in a trancelike meditation, during which you retain consciousness."
      }
    ],
    "created_at": "2025-10-23T07:54:36.597+00:00",
    "key": "elf",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "5df97dc4-0b08-4d04-bfe9-790e0eac7318",
    "name": "Fairy",
    "source": "Mordenkainen Presents: Monsters of the Multiverse",
    "description": "Infused with the magic of the Feywild, most fairies look like Small elves with insectile wings, but each fairy has a special physical characteristic that sets the fairy apart.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/fairy/fairy.webp",
    "creature_type": "Fey",
    "size": "Small",
    "speed": "30 feet, Fly equal to your walking speed",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/fairy/fairy_main.png",
    "traits": [
      "Fairy Magic",
      "Flight"
    ],
    "details": [
      {
        "type": "description",
        "content": "The Feywild is home to many fantastic peoples, including fairies. Fairies are a wee folk, but not nearly as much so as their pixie and sprite friends. The first fairies spoke Elvish, Goblin, or Sylvan, and encounters with human visitors prompted many of them to learn Common as well.\n\nInfused with the magic of the Feywild, most fairies look like Small elves with insectile wings, but each fairy has a special physical characteristic that sets the fairy apart. For your fairy, roll on the Fey Characteristics table or choose an option from it. You're also free to come up with your own characteristic if none of the suggestions below fit your character.\n\nFey Characteristic"
      },
      {
        "type": "table",
        "table": {
          "rows": [
            [
              "1",
              "Your wings are like those of a bird."
            ],
            [
              "2",
              "You have shimmering, multicolored skin."
            ],
            [
              "3",
              "You have exceptionally large ears."
            ],
            [
              "4",
              "A glittering mist constantly surrounds you."
            ],
            [
              "5",
              "You have a small spectral horn on your forehead, like a little unicorn horn."
            ],
            [
              "6",
              "Your legs are insectile."
            ],
            [
              "7",
              "Your legs are insectile."
            ],
            [
              "8",
              "A noticeable, harmless chill surrounds you."
            ]
          ],
          "headers": [
            "d8",
            "Characteristic"
          ]
        },
        "content": ""
      }
    ],
    "features": [
      {
        "title": "Fairy Magic",
        "description": "You know the druidcraft cantrip. Starting at 3rd level, you can cast the faerie fire spell with this trait. Starting at 5th level, you can also cast the enlarge/reduce spell with this trait. Once you cast faerie fire or enlarge/reduce with this trait, you can't cast that spell with it again until you finish a long rest. You can also cast either of those spells using any spell slots you have of the appropriate level.\n\nIntelligence, Wisdom, or Charisma is your spellcasting ability for these spells when you cast them with this trait (choose when you select this race)."
      },
      {
        "title": "Flight",
        "description": "Because of your wings, you have a flying speed equal to your walking speed. You can't use this flying speed if you're wearing medium or heavy armor."
      }
    ],
    "created_at": "2025-10-23T07:54:37.078+00:00",
    "key": "fairy",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "85c27835-80bf-4a35-9af4-fb0aff6f6640",
    "name": "Firbolg",
    "source": "Mordenkainen Presents: Monsters of the Multiverse",
    "description": "Distant cousins of giants, the first firbolgs wandered the primeval forests of the multiverse, and the magic of those forests entwined itself with the firbolgs’ souls.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/firbolg/firbolg.webp",
    "creature_type": "Humanoid",
    "size": "Medium",
    "speed": "30 feet",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/firbolg/firbolg_main.png",
    "traits": [
      "Firbolg Magic",
      "Hidden Step",
      "Powerful Build",
      "Speech of Beast and Leaf"
    ],
    "details": [
      {
        "type": "description",
        "content": "Distant cousins of giants, the first firbolgs wandered the primeval forests of the multiverse, and the magic of those forests entwined itself with the firbolgs' souls. Centuries later, that magic still thrums inside a firbolg, even one who has never lived under the boughs of a great forest.\n\nA firbolg's magic is an obscuring sort, which allowed their ancestors to pass through a forest without disturbing it. So deep is the connection between a firbolg and the wild places of the world that they can communicate with flora and fauna.\n\nFirbolgs can live up to 500 years."
      }
    ],
    "features": [
      {
        "title": "Firbolg Magic",
        "description": "You can cast detect magic and disguise self spells with this trait. When you use this version of disguise self, you can seem up to 3 feet shorter or taller. Once you cast either of these spells with this trait, you can't cast that spell with it again until you finish a long rest. You can also cast these spells using any spell slots you have.\n\nIntelligence, Wisdom, or Charisma is your spellcasting ability for these spells when you cast them with this trait (choose when you select this race)."
      },
      {
        "title": "Hidden Step",
        "description": "As a bonus action, you can magically turn invisible until the start of your next turn or until you attack, make a damage roll, or force someone to make a saving throw. You can use this trait a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
      },
      {
        "title": "Powerful Build",
        "description": "You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift."
      },
      {
        "title": "Speech of Beast and Leaf",
        "description": "You have the ability to communicate in a limited manner with Beasts, Plants, and vegetation. They can understand the meaning of your words, though you have no special ability to understand them in return. You have advantage on all Charisma checks you make to influence them."
      }
    ],
    "created_at": "2025-10-23T07:54:37.551+00:00",
    "key": "firbolg",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "52915a2d-ee21-4d27-a8f2-b02af955be5d",
    "name": "Fire Genasi",
    "source": "Mordenkainen Presents: Monsters of the Multiverse",
    "description": "Descended from efreet, the genies of the Elemental Plane of Fire, fire genasi channel the flamboyant and often destructive nature of flame.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/fire_genasi/fire_genasi.webp",
    "creature_type": "Humanoid",
    "size": "Small or Medium",
    "speed": "30 feet",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/fire_genasi/fire_genasi_main.png",
    "traits": [
      "Darkvision",
      "Fire Resistance",
      "Reach to the Blaze"
    ],
    "details": [
      {
        "type": "description",
        "content": "Tracing their ancestry to the genies of the Elemental Planes, each genasi can tap into the power of one of the elements. Air, earth, fire, and water—these are the four pillars of the Material Plane and the four types of genasi. Some genasi are direct descendants of a genie, while others were born to non-genasi parents who lived near a place suffused by a genie's magic.\n\nA typical genasi has a life span of 120 years."
      }
    ],
    "features": [
      {
        "title": "Darkvision",
        "description": "You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
      },
      {
        "title": "Fire Resistance",
        "description": "You have resistance to fire damage."
      },
      {
        "title": "Reach to the Blaze",
        "description": "You know the produce flame cantrip. Starting at 3rd level, you can cast the burning hands spell with this trait. Starting at 5th level, you can also cast the flame blade spell with this trait, without a material component. Once you cast burning hands or flame blade with this trait, you can't cast that spell with it again until you finish a long rest. You can also cast either of those spells using any spell slots you have of the appropriate level.\n\nIntelligence, Wisdom, or Charisma is your spellcasting ability for these spells when you cast them with this trait (choose when you select this race)."
      }
    ],
    "created_at": "2025-10-23T07:54:38.028+00:00",
    "key": "fire_genasi",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "82c6208e-b4fc-4d2a-bf9c-572faf1c6958",
    "name": "Giff",
    "source": "Astral Adventurer's Guide",
    "description": "As beings of impressive size and unforgettable appearance, giff are noticed wherever they go.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/giff/giff.webp",
    "creature_type": "Humanoid",
    "size": "Medium",
    "speed": "30 feet, Swim equal to your walking speed",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/giff/giff_main.png",
    "traits": [
      "Astral Spark",
      "Firearms Mastery",
      "Hippo Build"
    ],
    "details": [
      {
        "type": "description",
        "content": "Giff are tall, broad-shouldered folk with hippo-like features. Some have smooth skin, while others have short bristles on their faces and the tops of their heads. As beings of impressive size and unforgettable appearance, giff are noticed wherever they go.\n\nMost giff believe they originated on one world, but their home world is now the stuff of legend, because no living giff has seen it or knows where it is. The divine beings who created giff have likewise been forgotten. Their titanic petrified bodies drift on the Astral Sea, isolated and unrecognizable in their current forms.\n\nAlthough they don't realize it, giff are drawn to the Astral Plane because, on a deep psychic level, they remain connected to their creator gods, who have just enough divine spark left in them to imbue giff with sparks of their own, which giff have learned to channel through their weapons. Most giff have no idea where this so-called astral spark comes from, but they feel its presence most strongly when they are in Wildspace or the Astral Sea.\n\nGiff are split into two camps concerning how their name is pronounced. Half of them say it with a hard g, half with a soft g. Disagreements over the correct pronunciation often blossom into hard feelings, loud arguments, and head-butting contests, but they rarely escalate beyond that."
      }
    ],
    "features": [
      {
        "title": "Astral Spark",
        "description": "Your psychic connection to the Astral Plane enables you to mystically access a spark of divine power, which you can channel through your weapons. When you hit a target with a simple or martial weapon, you can cause the target to take extra force damage equal to your proficiency bonus.\n\nYou can use this trait a number of times equal to your proficiency bonus, but you can use it no more than once per turn. You regain all expended uses when you finish a long rest."
      },
      {
        "title": "Firearms Mastery",
        "description": "You have a mystical connection to firearms that traces back to the gods of the giff, who delighted in such weapons. You have proficiency with all firearms and ignore the loading property of any firearm. In addition, attacking at long range with a firearm doesn't impose disadvantage on your attack roll."
      },
      {
        "title": "Hippo Build",
        "description": "You have advantage on Strength-based ability checks and Strength saving throws. In addition, you count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift."
      }
    ],
    "created_at": "2025-10-23T07:54:38.506+00:00",
    "key": "giff",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "c75d03bd-f2c2-4b2d-81c4-66f30dfeb870",
    "name": "Githyanki",
    "source": "Mordenkainen Presents: Monsters of the Multiverse",
    "description": "Githyanki complement their physical prowess with psionic might, instilled in them by mind flayers and cultivated over eons in the Astral Plane.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/githyanki/githyanki.webp",
    "creature_type": "Humanoid",
    "size": "Medium",
    "speed": "30 feet",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/githyanki/githyanki_main.png",
    "traits": [
      "Astral Knowledge",
      "Githyanki Psionics",
      "Psychic Resilience"
    ],
    "details": [
      {
        "type": "description",
        "content": "Once members of a people who escaped servitude to mind flayers, githyanki split from their cousins, githzerai, and fled to the Astral Plane. In that timeless, silvery realm, githyanki honed their psionic powers and built a great city called Tu'narath. They have since spread throughout the multiverse, starting in outposts outside the Astral Plane, called creches, where time passes and their children can reach adulthood.\n\nA lanky people with skin tones of yellows, greens, and browns, githyanki complement their physical prowess with psionic might, instilled in them by mind flayers and cultivated over eons in the Astral Plane. Now all githyanki can use their psychic bond with that plane to access splinters of knowledge left behind by beings who travel, live, and die among the silver astral clouds.\n\nGithyanki who reside in the Astral Plane can live indefinitely."
      }
    ],
    "features": [
      {
        "title": "Astral Knowledge",
        "description": "You can mystically access a reservoir of experiences of entities connected to the Astral Plane. Whenever you finish a long rest, you gain proficiency in one skill of your choice and with one weapon or tool of your choice, selected from the Player's Handbook, as you momentarily project your consciousness into the Astral Plane. These proficiencies last until the end of your next long rest."
      },
      {
        "title": "Githyanki Psionics",
        "description": "You know the mage hand cantrip, and the hand is invisible when you cast the cantrip with this trait.\n\nStarting at 3rd level, you can cast the jump spell with this trait. Starting at 5th level, you can also cast misty step with it. Once you cast jump or misty step with this trait, you can't cast that spell with it again until you finish a long rest. You can also cast either of those spells using any spell slots you have of the appropriate level.\n\nIntelligence, Wisdom, or Charisma is your spellcasting ability for these spells when you cast them with this trait (choose when you select this race). None of these spells require spell components when you cast them with this trait."
      },
      {
        "title": "Psychic Resilience",
        "description": "You have resistance to psychic damage."
      }
    ],
    "created_at": "2025-10-23T07:54:38.983+00:00",
    "key": "githyanki",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "19f810b9-afae-4ced-bea7-fd3d854fbbff",
    "name": "Githzerai",
    "source": "Mordenkainen Presents: Monsters of the Multiverse",
    "description": "Eons of cultivating their mental powers within the endless chaos of Limbo have imbued githzerai with the ability to shape psionic energy to protect themselves and probe minds.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/githzerai/githzerai.webp",
    "creature_type": "Humanoid",
    "size": "Medium",
    "speed": "30 feet",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/githzerai/githzerai_main.png",
    "traits": [
      "Githzerai Psionics",
      "Mental Discipline",
      "Psychic Resilience"
    ],
    "details": [
      {
        "type": "description",
        "content": "Githzerai migrated to the Everchanging Chaos of Limbo after the ancient schism that split their ancestors from their cousins, githyanki. Limbo is a roiling maelstrom of matter and energy, collapsing and reforming without purpose or direction, until a creature exerts deliberate will to stabilize it. Through their potent psionic power, githzerai carved a home for themselves amid the chaos. As the ages passed, githzerai explorers ranged out to other planes and worlds of the multiverse.\n\nGithzerai are generally slender, with speckled skin in shades of yellow, green, or brown. Eons of cultivating their mental powers within the endless chaos of Limbo have imbued githzerai with the ability to shape psionic energy to protect themselves and probe minds."
      }
    ],
    "features": [
      {
        "title": "Githzerai Psionics",
        "description": "You know the mage hand cantrip, and the hand is invisible when you cast the cantrip with this trait.\n\nStarting at 3rd level, you can cast the shield spell with this trait. Starting at 5th level, you can also cast the detect thoughts spell with it. Once you cast shield or detect thoughts spell with this trait, you can't cast that spell with it again until you finish a long rest. You can also cast either of those spells using any spell slots you have of the appropriate level.\n\nIntelligence, Wisdom, or Charisma is your spellcasting ability for these spells when you cast them with this trait (choose when you select this race). None of these spells require spell components when you cast them with this trait."
      },
      {
        "title": "Mental Discipline",
        "description": "Your innate psychic defenses grant you advantage on saving throws you make to avoid or end the charmed and frightened conditions on yourself."
      },
      {
        "title": "Psychic Resilience",
        "description": "You have resistance to psychic damage."
      }
    ],
    "created_at": "2025-10-23T07:54:39.453+00:00",
    "key": "githzerai",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "9713169a-34a9-4fa4-bea4-90751f0b2c43",
    "name": "Gnome",
    "source": "Player’s Handbook",
    "description": "Gnomes are magical folk created by gods of invention, illusions, and life underground.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/gnome/gnome.webp",
    "creature_type": "Humanoid",
    "size": "Small (about 3–4 feet tall)",
    "speed": "30 feet.",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/gnome/gnome_main.webp",
    "traits": [
      "Darkvision",
      "Gnomish Cunning",
      "Gnomish Lineage"
    ],
    "details": [
      {
        "type": "description",
        "content": "Gnomes are magical folk created by gods of invention, illusions, and life underground. The earliest gnomes were seldom seen by other folk due to the gnomes’ secretive nature and their propensity for living in forests and burrows. What they lacked in size, they made up for in cleverness. They confounded predators with traps and labyrinthine tunnels. They also learned magic from gods like Garl Glittergold, Baervan Wildwanderer, and Baravar Cloakshadow, who visited them in disguise. That magic eventually created the lineages of forest gnomes and rock gnomes.\n\nGnomes are petite folk with big eyes and pointed ears, who live around 425 years. Many gnomes like the feeling of a roof over their head, even if that “roof” is nothing more than a hat."
      }
    ],
    "features": [
      {
        "title": "Darkvision",
        "description": "You have Darkvision with a range of 60 feet."
      },
      {
        "title": "Gnomish Cunning",
        "description": "You have Advantage on Intelligence, Wisdom, and Charisma saving throws."
      },
      {
        "title": "Gnomish Lineage",
        "description": "You are part of a lineage that grants you supernatural abilities. Choose one of the following options; whichever one you choose, Intelligence, Wisdom, or Charisma is your spellcasting ability for the spells you cast with this trait (choose the ability when you select the lineage): Forest Gnome, or Rock Gnome."
      }
    ],
    "created_at": "2025-10-23T07:54:40.488+00:00",
    "key": "gnome",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "51a0c1db-0889-49cf-96c8-f88ddd54fb13",
    "name": "Ashlings",
    "source": "Kashlava's Collection of Tales",
    "description": "A man-made people, the Ashlings are short-lived by design as they were made to fight a war or battle. Now the knowledge of creation of Ashlings are almost lost, but some believe that it must be cruel.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/ashlings/ashlings.webp",
    "creature_type": "Humanoid",
    "size": "Medium (about 5 to over 6 feet tall)",
    "speed": "30 feet.",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/ashlings/ashlings_main.png",
    "traits": [
      "Darkvision",
      "Hopekindle",
      "Flickers Within Dying Flame",
      "Glow of the Restless"
    ],
    "details": [
      {
        "type": "description",
        "content": "Ashlings are a race of fleeting warriors, born from mystery and memory. They are believed to have been shaped from memoria—the lingering fragments of lost souls—woven into flesh within glass tubes and crystal vats. Their makers, a once-great city-state of alchemy and artifice, vanished long ago, leaving the Ashlings as the last living relics of forgotten ambition. How they were first forged is unknown, for the knowledge of their creation was lost with the fall of their city.\n\n Ashlings grow at impossible speed, reaching adulthood in three short months. Their lives, however, are as brief as they are intense: some burn out within only a handful of years, while the oldest among them rarely see four decades. Their existence is often compared to fireflies in the night—brilliant, luminous, and short-lived. Like those tiny lights, they blaze brightly against the darkness, only to fade before the world has grown accustomed to their glow.\n\n This transience has shaped their nature. Many Ashlings embrace the role of warriors, for battle gives them purpose, and glory is a way to ensure their spark is remembered when the body is gone. They throw themselves into combat with a fierce abandon, fighting as though every clash may be their last. Others, however, resist the path laid before them. They wander far from the battlefield, chasing art, song, or simple human connection, yearning to prove that they are more than weapons built to die. Their brief lives push them to live with intensity—every friendship, every laugh, every fleeting joy is treasured all the more because of how swiftly it may be lost.\n\n Stranger still are the dreams that haunt them. Many Ashlings speak of visions that do not belong to them—echoes of past lives, fragments of emotions and faces they should never know. Whether these are remnants of the memoria that formed them, or simply the fever-dreams of lives lived too quickly, no scholar can say.\n\n The world remembers little of the city-state that birthed them, save broken ruins and fearful legends. Some say the gods struck down the city for daring to tamper with life and soul. Others whisper that the Ashlings were never meant to survive beyond a single war, and that their continued existence is a flaw in the weave of fate itself. Whatever the truth, the Ashlings endure: like fireflies, their light burns for only a moment, but while it lasts, it is brilliant enough to pierce the dark."
      }
    ],
    "features": [
      {
        "title": "Darkvision",
        "description": "You can see in dim light within 60 feet of yourself as if it were bright light, and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
      },
      {
        "title": "Hopekindle",
        "description": "Your short life has hardened you against despair. You have advantage on saving throws against being frightened."
      },
      {
        "title": "Flickers Within Dying Flame",
        "description": "You require only 4 hours of sleep to gain the benefits of a long rest as you are design to deal with harsh environment. "
      },
      {
        "title": "Glow of the Restless",
        "description": "Starting at 3rd level, you can overdraw your life force as your main function is simply to fight, but your wishes to live would also flicker. You may grant yourself advantage on all attack rolls and saving throws until the start of your next turn. When you use this, you gain one level of exhaustion. You regain this ability after finishing a long rest."
      }
    ],
    "created_at": "2025-10-23T07:54:28.343+00:00",
    "key": "ashlings",
    "homebrew": true,
    "homebrew_id": ""
  },
  {
    "id": "837d1acb-4ee1-4c1b-b2cd-14c1a583f9a4",
    "name": "Goblin",
    "source": "Mordenkainen Presents: Monsters of the Multiverse",
    "description": "Many goblins pursue their own destinies, escaping the plots of both archfey and gods.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/goblin/goblin.webp",
    "creature_type": "Humanoid",
    "size": "Small",
    "speed": "30 feet",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/goblin/goblin_main.png",
    "traits": [
      "Goblinoid",
      "Darkvision",
      "Fey Ancestry",
      "Fury of the Small",
      "Nimble Escape"
    ],
    "details": [
      {
        "type": "description",
        "content": "A subterranean folk, goblins can be found in every corner of the multiverse, often beside their bugbear and hobgoblin kin. Long before the god Maglubiyet conquered them, early goblins served in the court of the Queen of Air and Darkness, one of the Feywild's archfey. Goblins thrived in her dangerous domain thanks to a special boon from her—a supernatural knack for finding the weak spots in foes larger than themselves and for getting out of trouble. Goblins brought this fey boon with them to worlds across the Material Plane, even if they don't remember the fey realm they inhabited before Maglubiyet's rise. Now many goblins pursue their own destinies, escaping the plots of both archfey and gods."
      }
    ],
    "features": [
      {
        "title": "Goblinoid",
        "description": "You are also considered a goblinoid for any prerequisite or effect that requires you to be a goblinoid."
      },
      {
        "title": "Darkvision",
        "description": "You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were in dim light. You discern colors in that darkness only as shades of gray."
      },
      {
        "title": "Fey Ancestry",
        "description": "You have advantage on saving throws you make to avoid or end the charmed condition on yourself."
      },
      {
        "title": "Fury of the Small",
        "description": "When you damage a creature with an attack or a spell and the creature's size is larger than yours, you can cause the attack or spell to deal extra damage to the creature. The extra damage equals your proficiency bonus.\n\nYou can use this trait a number of times equal to your proficiency bonus, regaining all expended uses when you finish a long rest, and you can use it no more than once per turn."
      },
      {
        "title": "Nimble Escape",
        "description": "You can take the Disengage or Hide action as a bonus action on each of your turns."
      }
    ],
    "created_at": "2025-10-23T07:54:40.968+00:00",
    "key": "goblin",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "36225b4d-c807-4c81-b422-1eace121526e",
    "name": "Goliath",
    "source": "Player’s Handbook",
    "description": "Goliaths are distant descendants of giants and seek heights above those reached by their ancestors.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/goliath/goliath.webp",
    "creature_type": "Humanoid",
    "size": "Medium (about 7-8 feet tall)",
    "speed": "35 feet",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/goliath/goliath_main.png",
    "traits": [
      "Giant Ancestry",
      "Large Form",
      "Powerful Build"
    ],
    "details": [
      {
        "type": "description",
        "content": "Towering over most folk, goliaths are distant descendants of giants. Each goliath bears the favors of the first giants—favors that manifest in various supernatural boons, including the ability to quickly grow and temporarily approach the height of goliaths' gigantic kin.\n\nGoliaths have physical characteristics that are reminiscent of the giants in their family lines. For example, some goliaths look like stone giants, while others resemble fire giants. Whatever giants they count as kin, goliaths have forged their own path in the multiverse—unencumbered by the internecine conflicts that have ravaged giantkind for ages—and seek heights above those reached by their ancestors."
      }
    ],
    "features": [
      {
        "list": [
          "Cloud's Jaunt (Cloud Giant). As a Bonus Action, you magically teleport up to 30 feet to an unoccupied space you can see.",
          "Fire's Burn (Fire Giant). When you hit a target with an attack roll and deal damage to it, you can also deal 1d10 Fire damage to that target.",
          "Frost's Chill (Frost Giant). When you hit a target with an attack roll and deal damage to it, you can also deal 1d6 Cold damage to that target and reduce its Speed by 10 feet until the start of your next turn.",
          "Hill's Tumble (Hill Giant). When you hit a Large or smaller creature with an attack roll and deal damage to it, you can give that target the Prone condition.",
          "Stone's Endurance (Stone Giant). When you take damage, you can take a Reaction to roll 1d12. Add your Constitution modifier to the number rolled and reduce the damage by that total.",
          "Storm's Thunder (Storm Giant). When you take damage from a creature within 60 feet of you, you can take a Reaction to deal 1d8 Thunder damage to that creature."
        ],
        "title": "Giant Ancestry",
        "description": "You are descended from Giants. Choose one of the following benefits—a supernatural boon from your ancestry; you can use the chosen benefit a number of times equal to your Proficiency Bonus, and you regain all expended uses when you finish a Long Rest:"
      },
      {
        "title": "Large Form",
        "description": "Starting at character level 5, you can change your size to Large as a Bonus Action if you're in a big enough space. This transformation lasts for 10 minutes or until you end it (no action required). For that duration, you have Advantage on Strength checks, and your Speed increases by 10 feet. Once you use this trait, you can't use it again until you finish a Long Rest."
      },
      {
        "title": "Powerful Build",
        "description": "You have Advantage on any ability check you make to end the Grappled condition. You also count as one size larger when determining your carrying capacity."
      }
    ],
    "created_at": "2025-10-23T07:54:42.803+00:00",
    "key": "goliath",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "0d802de2-3195-4158-b44c-de26ba7d87dc",
    "name": "Grung",
    "source": "One Grung Above",
    "description": "Your grung character has an assortment of inborn abilities, part and parcel of grung nature.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/grung/grung.webp",
    "creature_type": "Humanoid",
    "size": "Small",
    "speed": "25 feet, Climb equal to your walking speed",
    "asi": "Dexterity +2; Constitution +1",
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/grung/grung_main.png",
    "traits": [
      "Arboreal Alertness",
      "Amphibious",
      "Poison Immunity",
      "Poisonous Skin",
      "Standing Leap",
      "Water Dependency"
    ],
    "details": [
      {
        "type": "description",
        "content": "Grungs are aggressive froglike humanoids found in rain forests and tropical jungles. They are fiercely territorial and see themselves as superior to most other creatures.\n\nTree-Dwelling Amphibians. \nGrungs live in trees and prefer shade. A grung hatchery is maintained in well-guarded ground-level pools. About three months after hatching, a grung tadpole takes on the shape of an adult. It takes another six to nine months for a grung juvenile to reach maturity.\n\nCastes and Colors. \nGrung society is a caste system. Each caste lays eggs in a separate hatching pool, and juvenile grungs join their caste upon emergence from the hatchery. All grungs are a dull greenish gray when they are born, but each individual takes on the color of its caste as it grows to adulthood.\n\nGreen grungs are the tribe’s warriors, hunters, and laborers, and blue grungs work as artisans and in other domestic roles. Supervising and guiding both groups are the purple grungs, which serve as administrators and commanders.\n\nRed grungs are the tribe’s scholars and magic users. They are superior to purple, blue, and green grungs and given proper respect even by grungs of higher status. \n\nHigher castes include orange grungs, which are elite warriors that have authority over all lesser grungs, and gold grungs, which hold the highest leadership positions. A tribe’s sovereign is always a gold grung.\n\nA grung normally remains in its caste for life. On rare occasions, an individual that distinguishes itself with great deeds can earn an invitation to join a higher caste. Through a combination of herbal tonics and ritual magic, an elevated grung changes color and is inducted into its new caste in the same way that a juvenile of the caste would be. From then on, the grung and its progeny are members of the higher caste.\n\nNaturally Toxic. \nAll grungs secrete a substance that is harmless to them but poisonous to other creatures. A grung also uses venom to poison its weapons.\n\nSlavers. \nGrungs are always on the lookout for creatures they can capture and enslave. Grungs use slaves for all manner of menial tasks, but mostly they just like bossing them around. Slaves are fed mildly poisoned food to keep them lethargic and compliant. A creature afflicted in this way over a long period of time becomes a shell of its former self and can be restored to normalcy only by magic"
      }
    ],
    "features": [
      {
        "title": "Arboreal Alertness",
        "description": "You have proficiency in the Perception skill."
      },
      {
        "title": "Amphibious",
        "description": "You can breathe air and water."
      },
      {
        "title": "Poison Immunity",
        "description": "You're immune to poison damage and the poisoned condition."
      },
      {
        "title": "Poisonous Skin",
        "description": "Any creature that grapples you or otherwise comes into direct contact with your skin must succeed on a DC 12 Constitution saving throw or become poisoned for 1 minute. A poisoned creature no longer in direct contact with you can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.\n\nYou can also apply this poison to any piercing weapon as part of an attack with that weapon, though when you hit the poison reacts differently. The target must succeed on a DC 12 Constitution saving throw or take 2d4 poison damage."
      },
      {
        "title": "Standing Leap",
        "description": "Your long jump is up to 25 feet and your high jump is up to 15 feet, with or without a running start."
      },
      {
        "title": "Water Dependency",
        "description": "If you fail to immerse yourself in water for at least 1 hour during a day, you suffer one level of exhaustion at the end of that day. You can only recover from this exhaustion through magic or by immersing yourself in water for at least 1 hour."
      }
    ],
    "created_at": "2025-10-23T07:54:43.649+00:00",
    "key": "grung",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "ecc27527-ffd8-4f2c-885b-81300e7d768c",
    "name": "Hadozee",
    "source": "Astral Adventurer's Guide",
    "description": "Hadozees are sapient, bipedal beings eager to leave behind the fearsome predators of their homeworld and explore other worlds.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/hadozee/hadozee.webp",
    "creature_type": "Humanoid",
    "size": "Small or Medium",
    "speed": "30 feet, Climb equal to your walking speed",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/hadozee/hadozee_main.png",
    "traits": [
      "Dexterous Feet",
      "Glide",
      "Hadozee Dodge"
    ],
    "details": [
      {
        "type": "description",
        "content": "Hadozees' progenitors were mammals no bigger than housecats. Hunted by larger natural predators, they took to the trees and evolved wing-like flaps that enabled them to glide from branch to branch.\n\nToday, hadozees are sapient, bipedal beings eager to leave behind the fearsome predators of their homeworld and explore other worlds.\n\nIn addition to being natural climbers, hadozees have feet that are as dexterous as their hands, even to the extent of having opposable thumbs. Membranes of skin hang loosely from their arms and legs. When stretched taut, these membranes enable hadozees to glide. Hadozees wrap these wings around themselves to keep warm."
      }
    ],
    "features": [
      {
        "title": "Dexterous Feet",
        "description": "As a bonus action, you can use your feet to manipulate an object, open or close a door or container, or pick up or set down a Tiny object."
      },
      {
        "title": "Glide",
        "description": "When you fall at least 10 feet above the ground, you can use your reaction to extend your skin membranes to glide horizontally a number of feet equal to your walking speed, and you take 0 damage from the fall. You determine the direction of the glide."
      },
      {
        "title": "Hadozee Dodge",
        "description": "The magic that runs in your veins heightens your natural defenses. When you take damage, you can use your reaction to roll a d6. Add your proficiency bonus to the number rolled, and reduce the damage you take by an amount equal to that total (minimum of 0 damage).\n\nYou can use this trait a number of times equal to your proficiency bonus. You regain all expended uses when you finish a long rest."
      }
    ],
    "created_at": "2025-10-23T07:54:46.216+00:00",
    "key": "hadozee",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "9a5f3e52-878d-4906-80c9-7cda2a1cbf0d",
    "name": "Halfling",
    "source": "Player’s Handbook",
    "description": "Halflings possess a brave and adventurous spirit that leads them on journeys of discovery.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/halfling/halfling.webp",
    "creature_type": "Humanoid",
    "size": "Small (about 2-3 feet tall)",
    "speed": "30 feet",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/halfling/halfling_main.png",
    "traits": [
      "Brave",
      "Halfling Nimbleness",
      "Luck",
      "Naturally Stealthy"
    ],
    "details": [
      {
        "type": "description",
        "content": "Cherished and guided by gods who value life, home, and hearth, halflings gravitate toward bucolic havens where family and community help shape their lives. That said, many halflings possess a brave and adventurous spirit that leads them on journeys of discovery, affording them the chance to explore a bigger world and make new friends along the way. Their size—similar to that of a human child—helps them pass through crowds unnoticed and slip through tight spaces.\n\nAnyone who has spent time around halflings, particularly halfling adventurers, has likely witnessed the storied \"luck of the halflings\" in action. When a halfling is in mortal danger, an unseen force seems to intervene on the halfling's behalf. Many halflings believe in the power of luck, and they attribute their unusual gift to one or more of their benevolent gods, including Yondalla, Brandobaris, and Charmalaine. The same gift might contribute to their robust life spans (about 150 years).\n\nHalfling communities come in all varieties. For every sequestered shire tucked away in an unspoiled part of the world, there's a crime syndicate like the Boromar Clan in the Eberron setting or a territorial mob of halflings like those in the Dark Sun setting.\n\nHalflings who prefer to live underground are sometimes called strongheart halflings or stouts. Nomadic halflings, as well as those who live among humans and other tall folk, are sometimes called lightfoot halflings or tallfellows."
      }
    ],
    "features": [
      {
        "title": "Brave",
        "description": "You have Advantage on saving throws you make to avoid or end the Frightened condition."
      },
      {
        "title": "Halfling Nimbleness",
        "description": "You can move through the space of any creature that is a size larger than you, but you can't stop in the same space."
      },
      {
        "title": "Luck",
        "description": "When you roll a 1 on the d20 of a D20 Test, you can reroll the die, and you must use the new roll."
      },
      {
        "title": "Naturally Stealthy",
        "description": "You can take the Hide action even when you are obscured only by a creature that is at least one size larger than you."
      }
    ],
    "created_at": "2025-10-23T07:54:46.703+00:00",
    "key": "halfling",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "18d22331-8962-4ab3-9c65-3ef1fcbb5153",
    "name": "Half Elf",
    "source": "Player's Handbook",
    "description": "test",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/half_elf/half_elf.webp",
    "creature_type": "Humanoid",
    "size": "Medium",
    "speed": "30 feet",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/half_elf/half_elf_main.png",
    "traits": [
      "Darkvision",
      "Fey Ancestry",
      "Skill Versatility"
    ],
    "details": [
      {
        "type": "description",
        "content": "Walking in two worlds but truly belonging to neither, half-elves combine what some say are the best qualities of their elf and human parents: human curiosity, inventiveness, and ambition tempered by the refined senses, love of nature, and artistic tastes of the elves. Some half-elves live among humans, set apart by their emotional and physical differences, watching friends and loved ones age while time barely touches them. Others live with the elves, growing to adulthood while their peers continue to live as children, growing restless in the timeless elven realms. Many half-elves, unable to fit into either society, choose lives of solitary wandering or join with other misfits and outcasts in the adventuring life.\n\nOf Two Worlds\nTo humans, half-elves look like elves, and to elves, they look human. In height, they're on par with both parents, though they're neither as slender as elves nor as broad as humans. They range from under 5 feet to about 6 feet tall, and from 100 to 180 pounds, with men only slightly taller and heavier than women. Half-elf men do have facial hair, and sometimes grow beards to mask their elven ancestry. Half-elven coloration and features lie, somewhere between their human and elf parents, and thus show a variety even more pronounced than that found among either race. They tend to have the eyes of their elven parents.\n\nDiplomats or Wanderers\nHalf-elves have no lands of their own, though they are welcome in human cities and somewhat less welcome in elven forests. In large cities in regions where elves and humans interact often, half-elves are sometimes numerous enough to form small communities of their own. They enjoy the company of other half-elves, the only people who truly understand what it is to live between these two worlds.\n\nIn most parts of the world, though, half-elves are uncommon enough that one might live for years without meeting another. Some prefer to avoid company altogether, wandering the wilds as foresters, hunters, or adventurers and visiting civilization only rarely. Like elves, they are driven by the wanderlust that comes of their longevity. Others, in contrast, throw themselves into the thick of society, putting their charisma and social skills to great use in diplomatic roles or as swindlers.\n\nHalf-Elf Names\nHalf-elves use either human or elven naming conventions. As if to emphasize that they don't really fit in to either society, half-elves raised among humans are often given elven names, and those raised among elves often take human names.\n\nExcellent Ambassadors\nMany half-elves learn at an early age to get along with everyone, defusing hostility and finding common ground. As a race, they have elven grace without elven aloofness and human energy without human boorishness. They often make excellent ambassadors and go-betweens (except between elves and humans, since each side suspects the half-elf of favoring the other)."
      }
    ],
    "features": [
      {
        "title": "Darkvision",
        "description": "Thanks to your elf blood, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
      },
      {
        "title": "Fey Ancestry",
        "description": "You have advantage on saving throws against being charmed, and magic can't put you to sleep."
      },
      {
        "title": "Skill Versatility",
        "description": "You gain proficiency in two skills of your choice."
      }
    ],
    "created_at": "2025-10-23T07:54:47.173+00:00",
    "key": "half_elf",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "3081cff4-d52c-4822-a0a3-a0da078e2d2e",
    "name": "Tabaxi",
    "source": "Mordenkainen Presents: Monsters of the Multiverse",
    "description": "Created by the Cat Lord—a divine being of the Upper Planes—to blend the qualities of humanoids and cats, tabaxi are a varied people in both attitude and appearance.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/tabaxi/tabaxi.webp",
    "creature_type": "Humanoid",
    "size": "Small or Medium",
    "speed": "30 feet, Climb equal to your walking speed",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/tabaxi/tabaxi_main.png",
    "traits": [
      "Cat’s Claws",
      "Cat’s Talents",
      "Darkvision",
      "Feline Agility"
    ],
    "details": [
      {
        "type": "description",
        "content": "Created by the Cat Lord—a divine being of the Upper Planes—to blend the qualities of humanoids and cats, tabaxi are a varied people in both attitude and appearance. In some lands, tabaxi live like the cats they resemble, naturally curious and at home in playful environments. In other places, tabaxi live as other folk do, not exhibiting the feline behavior the Cat Lord intended.\n\nTabaxi's appearance is as varied as their attitudes. Some tabaxi have features or patterning in their fur like tigers, jaguars, or other big cats, while others have appearances more like a house cat. Still others have unique patterns or might style their fur to their preferences—or might even be hairless!"
      }
    ],
    "features": [
      {
        "title": "Cat’s Claws",
        "description": "You can use your claws to make unarmed strikes. When you hit with them, the strike deals 1d6 + your Strength modifier slashing damage, instead of the bludgeoning damage normal for an unarmed strike."
      },
      {
        "title": "Cat’s Talents",
        "description": "You have proficiency in the Perception and Stealth skills."
      },
      {
        "title": "Darkvision",
        "description": "You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
      },
      {
        "title": "Feline Agility",
        "description": "Your reflexes and agility allow you to move with a burst of speed. When you move on your turn in combat, you can double your speed until the end of the turn. Once you use this trait, you can't use it again until you move 0 feet on one of your turns."
      }
    ],
    "created_at": "2025-10-23T07:55:00.164+00:00",
    "key": "tabaxi",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "1450bd07-a6be-498e-a2d6-f5261f0f0cf3",
    "name": "Harengon",
    "source": "Mordenkainen Presents: Monsters of the Multiverse",
    "description": "Harengons are blessed with a little fey luck, and they often find themselves a few fortunate feet away from dangers during adventures.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/harengon/harengon.webp",
    "creature_type": "Humanoid",
    "size": "Small or Medium",
    "speed": "30 feet",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/harengon/harengon_main.png",
    "traits": [
      "Hare-Trigger",
      "Leporine Senses",
      "Lucky Footwork",
      "Rabbit Hop"
    ],
    "details": [
      {
        "type": "description",
        "content": "Harengons originated in the Feywild, where they spoke Sylvan and embodied the spirit of freedom and travel. In time, these rabbitfolk hopped into other worlds, bringing the fey realm's exuberance with them and learning new languages as they went.\n\nHarengons are bipedal, with the characteristic long feet of the rabbits they resemble and fur in a variety of colors. They share the keen senses and powerful legs of leporine creatures and are full of energy, like a wound-up spring. Harengons are blessed with a little fey luck, and they often find themselves a few fortunate feet away from dangers during adventures."
      }
    ],
    "features": [
      {
        "title": "Hare-Trigger",
        "description": "You can add your proficiency bonus to your initiative rolls."
      },
      {
        "title": "Leporine Senses",
        "description": "You have proficiency in the Perception skill."
      },
      {
        "title": "Lucky Footwork",
        "description": "When you fail a Dexterity saving throw, you can use your reaction to roll a d4 and add it to the save, potentially turning the failure into a success. You can't use this reaction if you're prone or your speed is 0."
      },
      {
        "title": "Rabbit Hop",
        "description": "As a bonus action, you can jump a number of feet equal to five times your proficiency bonus, without provoking opportunity attacks. You can use this trait only if your speed is greater than 0. You can use it a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
      }
    ],
    "created_at": "2025-10-23T07:54:47.655+00:00",
    "key": "harengon",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "6828403c-b90c-415c-b3f6-b5ba0fa94b2f",
    "name": "Hexblood",
    "source": "Van Richten’s Guide to Ravenloft",
    "description": "Hexbloods are mortals touched by hag magic, bearing strange marks and fey gifts that set them apart from others.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/hexblood/hexblood.webp",
    "creature_type": "Fey",
    "size": "You are Medium or Small. You choose the size when you gain this lineage.",
    "speed": "30 feet.",
    "asi": "Increase one ability score by 2 and two other scores by 1, or increase three different scores by 1.",
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/hexblood/hexblood_main.png",
    "traits": [
      "Ancestral Legacy",
      "Darkvision",
      "Eerie Token",
      "Hex Magic"
    ],
    "details": [
      {
        "type": "description",
        "content": "Where wishing fails, ancient magic can offer a heart’s desire—at least, for a time. Hexbloods are individuals infused with eldritch magic, fey energy, or mysterious witchcraft. Some who enter into bargains with hags gain their deepest wishes but eventually find themselves transformed. These changes evidence a hag’s influence: ears that split in forked points, skin in lurid shades, long hair that regrows if cut, and an irremovable living crown. Along with these marks, hexbloods manifest hag-like traits, such as darkvision and a variety of magical methods to beguile the senses and avoid the same.\n\nWhile many hexbloods gain their lineage after making a deal with a hag, others reveal their nature as they age—particularly if a hag influenced them early in life or even before their birth. Many hexbloods turn to lives of adventure, seeking to discover the mysteries of their magic, to forge a connection with their fey natures, or to avoid a hag that obsesses over them.\n\nHeir of Hags :\nOne way hags create more of their kind is through the creation of hexbloods. Every hexblood exhibits features suggestive of the hag whose magic inspires their powers. This includes an unusual crown, often called an eldercross or a witch’s turn. This living, garland-like part of a hexblood’s body extends from their temples and wraps behind the head, serving as a visible mark of the bargain between hag and hexblood, a debt owed, or a change to come.\n\nHexblood Origins :\nA bargain with a hag or other eerie forces transformed your character into a magical being. Roll on or choose an option from the Hexblood Origins table to determine how your character gained their lineage."
      },
      {
        "type": "table",
        "table": {
          "rows": [
            [
              "1",
              "Seeking a child, your parent made a bargain with a hag. You are the result of that arrangement."
            ],
            [
              "2",
              "Fey kidnappers swapped you and your parents’ child."
            ],
            [
              "3",
              "A coven of hags lost one of its members. You were created to replace the lost hag."
            ],
            [
              "4",
              "You were cursed as a child. A deal with the spirits of the forest transformed you into a hexblood, now free of the curse."
            ],
            [
              "5",
              "You began life as a fey creature, but an accident changed you and forced you from your home."
            ],
            [
              "6",
              "A slighted druid transformed you and bound you to live only so long as a sacred tree bears fruit."
            ]
          ],
          "headers": [
            "d6",
            "Origin"
          ]
        },
        "content": ""
      }
    ],
    "features": [
      {
        "title": "Ancestral Legacy",
        "description": "If you replace a race with this lineage, you can keep the following elements of that race: any skill proficiencies you gained from it and any climbing, flying, or swimming speed you gained from it.\n\nIf you don’t keep any of those elements or you choose this lineage at character creation, you gain proficiency in two skills of your choice."
      },
      {
        "title": "Darkvision",
        "description": "You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness as shades of gray."
      },
      {
        "list": [
          "Telepathic Message. As an action, you can send a telepathic message to the creature holding or carrying the token, as long as you are within 10 miles of it. The message can contain up to twenty-five words.",
          "Remote Viewing. If you are within 10 miles of the token, you can enter a trance as an action. The trance lasts for 1 minute, but it ends early if you dismiss it (no action required) or are incapacitated. During this trance, you can see and hear from the token as if you were located where it is. While you are using your senses at the token’s location, you are blinded and deafened in regard to your own surroundings. When the trance ends, the token is harmlessly destroyed."
        ],
        "title": "Eerie Token",
        "description": "As a bonus action, you can harmlessly remove a lock of your hair, one of your nails, or one of your teeth. This token is imbued with magic until you finish a long rest. Once you create a token using this feature, you can’t do so again until you finish a long rest, at which point your missing part regrows. While the token is imbued in this way, you can take these actions:"
      },
      {
        "title": "Hex Magic",
        "description": "You can cast the disguise self and hex spells with this trait. Once you cast either of these spells with this trait, you can’t cast that spell with it again until you finish a long rest. You can also cast these spells using any spell slots you have.\n\nIntelligence, Wisdom, or Charisma is your spellcasting ability for these spells (choose the ability when you gain this lineage)."
      }
    ],
    "created_at": "2025-10-23T07:54:48.124+00:00",
    "key": "hexblood",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "2241b72b-4ce5-4b9b-bd74-ff9d6f1daf7e",
    "name": "Hobgoblin",
    "source": "Mordenkainen Presents: Monsters of the Multiverse",
    "description": "Hobgoblins trace their origins to the ancient courts of the Feywild, where they first appeared with their goblin and bugbear kin.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/hobgoblin/hobgoblin.webp",
    "creature_type": "Humanoid",
    "size": "Medium",
    "speed": "30 feet",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/hobgoblin/hobgoblin_main.png",
    "traits": [
      "Goblinoid",
      "Darkvision",
      "Fey Ancestry",
      "Fey Gift",
      "Fortune from the Many"
    ],
    "details": [
      {
        "type": "description",
        "content": "Hobgoblins trace their origins to the ancient courts of the Feywild, where they first appeared with their goblin and bugbear kin. Many of them were driven from the Feywild by the conquering god Maglubiyet, who marshaled them as soldiers, but the fey realm left its mark; wherever they are in the multiverse, they continue to channel an aspect of the Feywild's rule of reciprocity, which creates a mystical bond between the giver and the receiver of a gift.\n\nOn some worlds, such bonds lead hobgoblins to form communities with deep ties to one another. In Eberron and the Forgotten Realms, vast hobgoblin legions have emerged, with ranks of devoted soldiers famed for their unity.\n\nHobgoblins are generally taller than their goblin cousins but not quite as big as bugbears. They have curved, pointed ears and noses that turn bright red or blue during displays of emotion."
      }
    ],
    "features": [
      {
        "title": "Goblinoid",
        "description": "You are also considered a goblinoid for any prerequisite or effect that requires you to be a goblinoid."
      },
      {
        "title": "Darkvision",
        "description": "You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
      },
      {
        "title": "Fey Ancestry",
        "description": "You have advantage on saving throws you make to avoid or end the charmed condition on yourself."
      },
      {
        "title": "Fey Gift",
        "description": "You can use this trait to take the Help action as a bonus action, and you can do so a number of times equal to your proficiency bonus. You regain all expended uses when you finish a long rest.\n\nStarting at 3rd level, choose one of the options below each time you take the Help action with this trait:\n\nHospitality. You and the creature you help each gain a number of temporary hit points equal to 1d6 plus your proficiency bonus.\n\nPassage. You and the creature you help each increase your walking speeds by 10 feet until the start of your next turn.\n\nSpite. Until the start of your next turn, the first time the creature you help hits a target with an attack roll, that target has disadvantage on the next attack roll it makes within the next minute."
      },
      {
        "title": "Fortune from the Many",
        "description": "If you miss with an attack roll or fail an ability check or a saving throw, you can draw on your bonds of reciprocity to gain a bonus to the roll equal to the number of allies you can see within 30 feet of you (maximum bonus of +3). You can use this trait a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
      }
    ],
    "created_at": "2025-10-23T07:54:48.606+00:00",
    "key": "hobgoblin",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "2ad51f5d-f653-42f2-a7f8-53d1b811d9a1",
    "name": "Human",
    "source": "Player's Handbook",
    "description": "Found throughout the multiverse, humans are as varied as they are numerous.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/human/human.webp",
    "creature_type": "Humanoid",
    "size": "Medium (about 4-7 feet tall) or Small (about 2-4 feet tall), chosen when you select this species",
    "speed": "30 feet",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/human/human_main.png",
    "traits": [
      "Resourceful",
      "Skillful",
      "Versatile"
    ],
    "details": [
      {
        "type": "description",
        "content": "Found throughout the multiverse, humans are as varied as they are numerous, and they endeavor to achieve as much as they can in the years they are given. Their ambition and resourcefulness are commended, respected, and feared on many worlds.\n\nHumans are as diverse in appearance as the people of Earth, and they have many gods. Scholars dispute the origin of humanity, but one of the earliest known human gatherings is said to have occurred in Sigil, the torus-shaped city at the center of the multiverse and the place where the Common language was born. From there, humans could have spread to every part of the multiverse, bringing the City of Doors' cosmopolitanism with them."
      }
    ],
    "features": [
      {
        "title": "Resourceful",
        "description": "You gain Heroic Inspiration whenever you finish a Long Rest."
      },
      {
        "title": "Skillful",
        "description": "You gain proficiency in one skill of your choice."
      },
      {
        "title": "Versatile",
        "description": "You gain an Origin feat of your choice."
      }
    ],
    "created_at": "2025-10-23T07:54:49.085+00:00",
    "key": "human",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "5367c1f9-c8ec-47a5-815b-19578de2de2c",
    "name": "Kalashtar",
    "source": "Eberron: Rising from the Last War",
    "description": "The kalashtar are a compound people created from the union of humanity and renegade spirits from the plane of dreams.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/kalashtar/kalashtar.webp",
    "creature_type": "Humanoid",
    "size": "Medium (about 5 to over 6 feet tall)",
    "speed": "30 feet.",
    "asi": "+2 Wisdom, +1 to Charisma ",
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/kalashtar/kalashtar_main.webp",
    "traits": [
      "Dual Mind",
      "Mental Discipline",
      "Mind Link",
      "Severed from Dreams"
    ],
    "details": [
      {
        "type": "description",
        "content": "The ancestors of the kalashtar were human monks of Adar who formed a mystical bond with displaced spirits from Dal Quor, the Region of Dreams. These quori, seeking refuge from the tyrannical Dreaming Dark, merged their essence with willing mortals rather than possess them. Some legends claim the Path of Light guided this union, while others say desperation alone forged it. Whatever their first purpose, kalashtar have walked the Material Plane as living vessels of both mortal will and dream-born spirit ever since.\n\nThough they appear human at a glance, the kalashtar bear an otherworldly calm that sets them apart. Their eyes can gleam faintly with inner light, their words often carry a measured clarity, and their expressions hold a serenity not often found in other mortals. The touch of the quori does not alter their bodies, but it shapes their bearing, every step and glance carrying a quiet resonance as though they listen to music beyond the world of waking senses.\n\nThe kalashtar are bound to dreams in ways no other mortals are. They cannot be touched by nightmares as others can, for their spirits are sheltered from Dal Quor’s grasp. Yet sleep still calls them, and in its depths they feel the echoes of distant dreamscapes, fragments of light, whispers of memory, and the stirring presence of their quori soul. For some kalashtar, this connection brings inspiration, visions, or flashes of insight. For others, it is a burden, a reminder of the eternal war between light and shadow waged in the heart of the Dreaming Dark.\n\nThis dual nature marks the kalashtar as both blessed and burdened, forever straddling the boundary between dreams and reality. Their lives are shaped by balance, the mortal needs of flesh and blood bound to the immortal whispers of spirit. Some see themselves as guardians of peace and followers of the Path of Light, striving to bring harmony to a world plagued by strife. Others struggle with alienation, feeling pulled between two selves that can never fully become one. Whatever their path, the kalashtar remain living bridges between waking life and the endless sea of dreams."
      }
    ],
    "features": [
      {
        "title": "Dual Mind",
        "description": "You have advantage on all Wisdom saving throws."
      },
      {
        "title": "Mental Discipline",
        "description": "You have resistance to psychic damage."
      },
      {
        "title": "Mind Link",
        "description": "You can speak telepathically to any creature you can see, provided the creature is within a number of feet of you equal to 10 times your level. You don’t need to share a language with the creature for it to understand your telepathic utterances, but the creature must be able to understand at least one language.\n\nWhen you’re using this trait to speak telepathically to a creature, you can use your action to give that creature the ability to speak telepathically with you for 1 hour or until you end this effect as an action. To use this ability, the creature must be able to see you and must be within this trait’s range. You can give this ability to only one creature at a time; giving it to a creature takes it away from another creature who has it."
      },
      {
        "title": "Severed from Dreams",
        "description": "Kalashtar sleep, but they don’t connect to the plane of dreams as other creatures do. Instead, their minds draw from the memories of their otherworldly spirit while they sleep. As such, you are immune to spells and other magical effects that require you to dream, like dream, but not to spells and other magical effects that put you to sleep, like sleep."
      }
    ],
    "created_at": "2025-10-23T07:54:49.56+00:00",
    "key": "kalashtar",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "21a6278e-03b9-4a07-987a-d05a2a78c1a4",
    "name": "Kender",
    "source": "Dragonlance: Shadow of the Dragon Queen",
    "description": "Kender have a supernatural curiosity that drives them to adventure.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/kender/kender.webp",
    "creature_type": "Humanoid",
    "size": "Small",
    "speed": "30 feet",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/kender/kender_main.jpg",
    "traits": [
      "Fearless",
      "Kender Curiosity",
      "Taunt"
    ],
    "details": [
      {
        "type": "description",
        "content": "During the mythical origins of Krynn, Reorx, god of craft, indulged in an age of unfettered creation. Many peoples sprang from his divine forge, but not all among them remained as the god created them. Altered by unbridled magic, a group of gnomes were transformed and given almost supernatural curiosity and fearlessness. These were the first kender.\n\nOriginating on the world of Krynn, kender are diminutive Humanoids who look like humans with pointed ears and diverse appearances. Kender have a supernatural curiosity that drives them to adventure. Due to this inquisitiveness, many kender find themselves falling through portals to other planes and worlds.\n\nKender sometimes amass impressive collections of curiosities. Some might collect mundane knickknacks or relics from magical sites, while others might become professional thieves."
      }
    ],
    "features": [
      {
        "title": "Fearless",
        "description": "You have advantage on saving throws you make to avoid or end the frightened condition on yourself. When you fail a saving throw to avoid or end the frightened condition on yourself, you can choose to succeed instead. Once you succeed on a saving throw in this way, you can't do so again until you finish a long rest."
      },
      {
        "title": "Kender Curiosity",
        "description": "Thanks to the mystical origin of your people, you gain proficiency with one of the following skills of your choice: Insight, Investigation, Sleight of Hand, Stealth, or Survival."
      },
      {
        "title": "Taunt",
        "description": "You have an extraordinary ability to fluster creatures. As a bonus action, you can unleash a string of provoking words at a creature within 60 feet of yourself that can hear and understand you. The target must succeed on a Wisdom saving throw, or it has disadvantage on attack rolls against targets other than you until the start of your next turn. The DC equals 8 + your proficiency bonus + your Intelligence, Wisdom, or Charisma modifier (choose when you select this race).\n\nYou can use this bonus action a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
      }
    ],
    "created_at": "2025-10-23T07:54:50.037+00:00",
    "key": "kender",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "4b07055b-6506-46e2-b52a-907268afc7e0",
    "name": "Kenku",
    "source": "Mordenkainen Presents: Monsters of the Multiverse",
    "description": "Whatever their true origin, kenku are most often found in the Shadowfell and the Material Plane, and they tend to have the coloration typical of ravens.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/kenku/kenku.webp",
    "creature_type": "Humanoid",
    "size": "Small or Medium",
    "speed": "30 feet",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/kenku/kenku_main.png",
    "traits": [
      "Expert Duplication",
      "Kenku Recall",
      "Mimicry"
    ],
    "details": [
      {
        "type": "description",
        "content": "Feathered folk who resemble ravens, kenku are blessed with keen observation and supernaturally accurate memories. None of them can remember the origin of the first kenku, however, and they often joke that there are as many kenku origin stories as there are kenku. Some of them paint their genesis as a curse, being a flightless bird people doomed to mimic other people's creations. Other kenku recite cryptic but beautiful poems about their advent being a blessed event in which they were sent into the multiverse to observe and catalog its many wonders.\n\nWhatever their true origin, kenku are most often found in the Shadowfell and the Material Plane, and they tend to have the coloration typical of ravens."
      }
    ],
    "features": [
      {
        "title": "Expert Duplication",
        "description": "When you copy writing or craftwork produced by yourself or someone else, you have advantage on any ability checks you make to produce an exact duplicate."
      },
      {
        "title": "Kenku Recall",
        "description": "Thanks to your supernaturally good memory, you have proficiency in two skills of your choice.\n\nMoreover, when you make an ability check using any skill in which you have proficiency, you can give yourself advantage on the check before rolling the d20. You can give yourself advantage in this way a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
      },
      {
        "title": "Mimicry",
        "description": "You can accurately mimic sounds you have heard, including voices. A creature that hears the sounds you make can tell they are imitations only with a successful Wisdom (Insight) check against a DC of 8 + your proficiency bonus + your Charisma modifier."
      }
    ],
    "created_at": "2025-10-23T07:54:50.557+00:00",
    "key": "kenku",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "98c35d7e-7744-4b82-b439-5af4d7e9b395",
    "name": "Kobold",
    "source": "Mordenkainen Presents: Monsters of the Multiverse",
    "description": "Some of the smallest draconic creatures in the multiverse, kobolds display their draconic ancestry in the glint of their scales and in their roars.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/kobold/kobold.webp",
    "creature_type": "Humanoid",
    "size": "Small",
    "speed": "30 feet",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/kobold/kobold_main.png",
    "traits": [
      "Darkvision",
      "Draconic Cry",
      "Kobold Legacy"
    ],
    "details": [
      {
        "type": "description",
        "content": "Some of the smallest draconic creatures in the multiverse, kobolds display their draconic ancestry in the glint of their scales and in their roars. Legends tell of the first kobolds emerging from the Underdark near the lairs of the earliest dragons. In some lands, kobolds serve chromatic or metallic dragons—even worshiping them as divine beings. In other places, kobolds know too well how dangerous those dragons can be and help others defend against draconic destruction.\n\nWhatever their relationship to dragons, kobold scales tend to be rust colored, although the occasional kobold sports a scale color more akin to that of a chromatic or a metallic dragon. A kobold's cry can express a range of emotion: anger, resolve, elation, fear, and more. Regardless of the emotion expressed, their cry resonates with draconic power."
      }
    ],
    "features": [
      {
        "title": "Darkvision",
        "description": "You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were in dim light. You discern colors in that darkness only as shades of gray."
      },
      {
        "title": "Draconic Cry",
        "description": "As a bonus action, you let out a cry at your enemies within 10 feet of you. Until the start of your next turn, you and your allies have advantage on attack rolls against any of those enemies who could hear you. You can use this trait a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
      },
      {
        "list": [
          "Craftiness. You have proficiency in one of the following skills of your choice: Arcana, Investigation, Medicine, Sleight of Hand, or Survival.",
          "Defiance. You have advantage on saving throws to avoid or end the frightened condition on yourself.",
          "Draconic Sorcery. You know one cantrip of your choice from the sorcerer spell list. Intelligence, Wisdom, or Charisma is your spellcasting ability for that cantrip (choose when you select this race)."
        ],
        "title": "Kobold Legacy",
        "description": "Kobold's connections to dragons can manifest in unpredictable ways in an individual kobold. Choose one of the following legacy options for your kobold."
      }
    ],
    "created_at": "2025-10-23T07:54:51.052+00:00",
    "key": "kobold",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "b099bdad-2fd7-4d9b-af34-aedf47892198",
    "name": "Leonin",
    "source": "Mythic Odysseys of Theros",
    "description": "Nomadic, lion-like humanoids who rarely interact with other peoples, having all they need in their shimmering homeland. ",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/leonin/leonin.webp",
    "creature_type": "Humanoid",
    "size": "Medium",
    "speed": "35 feet",
    "asi": "Constitution +2; Strength +1",
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/leonin/leonin_main.png",
    "traits": [
      "Darkvision",
      "Claws",
      "Hunter's Instincts",
      "Daunting Roar"
    ],
    "details": [
      {
        "type": "description",
        "content": "The leonin guard the shining lands of Oreskos, a golden plain where even the gods rarely trespass. Prides of these nomadic, lion-like humanoids rarely interact with other peoples, having all they need in their shimmering homeland and knowing the treachery of strangers. Still, some leonin wonder what lies beyond Oreskos's border mountains and seek to test themselves in a wider world."
      },
      {
        "type": "description",
        "content": "Noble and Fierce\nLeonin tend to be tall compared to humans and move with a boldness that suggests their physical might. Tawny fur covers leonin bodies, and some grow thick manes ranging in shades from gold to black. While their hands prove as nimble as those of other humanoids, leonin have retractable feline claws, which they can extend instantly. This, along with their ability to produce bone-shaking roars, gives most leonin an air that readily shifts between regal and fearsome.\n\nLeonin often act with confidence, which can come off as imperiousness. While this can reassure their allies, it can also suggest defiance in the face of what they perceive as imposed authority or unworthy experts."
      },
      {
        "type": "description",
        "content": "Quick to Quarrel\nOther peoples often perceive leonin as quick to take offense, intolerant of criticism, or belligerent. The truth is that many leonin simply enjoy fighting, whether verbal or physical. They take pleasure in argument, wrestling, sparring, and even battle, enjoying the opportunity to exercise their minds and bodies.\n\nIt follows, too, that leonin aren't inclined to carry grudges. A warrior might react with sudden violence to an insult, but when the fight is over (and the leonin's superiority proven), the insult is forgotten—along with the vanquished foe."
      },
      {
        "type": "description",
        "content": "Pride and Self-Reliance\nFew leonin devote themselves to the service of the gods. Centuries ago, the leonin worshiped the same gods that humans do, but after many of their prides suffered depravities at the hands of the tyrant Agnomakhos, most leonin rejected the gods. It's not that they deny the existence of deities; they merely see the gods as mercurial and ultimately unworthy of adoration. The Leonin and the Gods table suggests the range of attitudes that leonin might adopt toward the gods.\n\nLeonin rely on themselves and their prides. A pride is bound together by the experience of a shared challenge and, in particular, the sacred act of the hunt. See chapter 3 for more details on Oreskos and the leonin who call that land home.\n\nLeonin and the Gods"
      },
      {
        "type": "table",
        "table": {
          "rows": [
            [
              "1",
              "I'm amused by the antics of the gods and their earnest, but ultimately deluded, mortal champions, and I feel smugly superior in my detachment."
            ],
            [
              "2",
              "The meddling of the gods in mortal affairs makes me angry and bitter. I wish they would just leave us all alone!"
            ],
            [
              "3",
              "I view the gods as worthy adversaries—incredibly clever and well-prepared to play a long game but ultimately doomed to lose their games."
            ],
            [
              "4",
              "I'm certain every bad thing that happens can ultimately be blamed on the gods, but I roll my eyes at each new twist of fate and try to get on with my life."
            ],
            [
              "5",
              "I wish that I could be as naive as humans and other mortals who actually think the gods are looking out for them. I miss that kind of innocence."
            ],
            [
              "6",
              "I don't talk about it among other leonin, but I actually revere the gods and try to please them by my actions."
            ]
          ],
          "headers": [
            "d6",
            "Attitude"
          ]
        },
        "content": ""
      },
      {
        "type": "description",
        "content": "Leonin Names\nAlong with their personal names, leonin identify themselves by their pride. A member of the Flintclaw pride with the personal name of Ziore, for example, would likely style herself as Ziore of the Flintclaw."
      },
      {
        "list": [
          "Female Names: Aletha, Atagone, Demne, Doxia, Ecate, Eriz, Gragonde, Iadma, Koila, Oramne, Seza, Ziore",
          "Male Names: Apto, Athoz, Baragon, Bryguz, Eremoz, Gorioz, Grexes, Oriz, Pyxathor, Teoz, Xemnon, Xior",
          "Pride Names: Embereye, Flintclaw, Goldenfield, Ironmane, Starfeller, Sunguides"
        ],
        "type": "list",
        "content": ""
      }
    ],
    "features": [
      {
        "title": "Darkvision",
        "description": "You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
      },
      {
        "title": "Claws",
        "description": "Your claws are natural weapons, which you can use to make unarmed strikes. If you hit with them, you can deal slashing damage equal to 1d4 + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike."
      },
      {
        "title": "Hunter's Instincts",
        "description": "You have proficiency in one of the following skills of your choice: Athletics, Intimidation, Perception, or Survival."
      },
      {
        "title": "Daunting Roar",
        "description": "As a bonus action, you can let out an especially menacing roar. Creatures of your choice within 10 feet of you that can hear you must succeed on a Wisdom saving throw or become frightened of you until the end of your next turn. The DC of the save equals 8 + your proficiency bonus + your Constitution modifier. Once you use this trait, you can't use it again until you finish a short or long rest."
      }
    ],
    "created_at": "2025-10-23T07:54:51.535+00:00",
    "key": "leonin",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "a701ab5e-2e2e-47ce-a53d-ea02cef494bc",
    "name": "Lizardfolk",
    "source": "Mordenkainen Presents: Monsters of the Multiverse",
    "description": "Gifted by the gods with remarkable physical defenses and a mystical connection to the natural world, lizardfolk can survive with just their wits in situations that would be deadly for other folk.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/lizardfolk/lizardfolk.webp",
    "creature_type": "Humanoid",
    "size": "Medium",
    "speed": "30 feet, Swim equal to your walking speed",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/lizardfolk/lizardfolk_main.png",
    "traits": [
      "Bite",
      "Hold Breath",
      "Hungry Jaws",
      "Natural Armor",
      "Nature’s Intuition"
    ],
    "details": [
      {
        "type": "description",
        "content": "The saurian lizardfolk are thought by some sages to be distant cousins of dragonborn and kobolds. Despite their resemblance to those other scaled folk, however, lizardfolk are their own people and have lived on the worlds of the Material Plane since the worlds' creation. Gifted by the gods with remarkable physical defenses and a mystical connection to the natural world, lizardfolk can survive with just their wits in situations that would be deadly for other folk. Because of that fact, many lizardfolk myths state that their people were placed by the gods in the Material Plane to guard its natural wonders.\n\nLizardfolk have colorful scales and exhibit a wide array of scale patterns. Their individual facial features are as varied as those of lizards."
      }
    ],
    "features": [
      {
        "title": "Bite",
        "description": "You have a fanged maw that you can use to make unarmed strikes. When you hit with it, the strike deals 1d6 + your Strength modifier slashing damage, instead of the bludgeoning damage normal for an unarmed strike."
      },
      {
        "title": "Hold Breath",
        "description": "You can hold your breath for up to 15 minutes at a time."
      },
      {
        "title": "Hungry Jaws",
        "description": "You can throw yourself into a feeding frenzy. As a bonus action, you can make a special attack with your Bite. If the attack hits, it deals its normal damage, and you gain temporary hit points equal to your proficiency bonus. You can use this trait a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
      },
      {
        "title": "Natural Armor",
        "description": "You have tough, scaly skin. When you aren't wearing armor, your base AC is 13 + Dexterity modifier. You can use your natural armor to determine your AC if the armor you wear would leave you with a lower AC. A shield's benefits apply as normal while you use your natural armor."
      },
      {
        "title": "Nature’s Intuition",
        "description": "Thanks to your mystical connection to nature, you gain proficiency with two of the following skills of your choice: Animal Handling, Medicine, Nature, Perception, Stealth, or Survival."
      }
    ],
    "created_at": "2025-10-23T07:54:52.003+00:00",
    "key": "lizardfolk",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "be16043c-5fe3-4591-8bce-3b9b57dedcc0",
    "name": "Locathah",
    "source": "Locathah Rising",
    "description": "These resilient and proud fish-folk have endured war, slavery, and mistreatment at the hands of other aquatic creatures.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/locathah/locathah.webp",
    "creature_type": "Humanoid",
    "size": "Medium",
    "speed": "30 feet, Swim equal to your walking speed",
    "asi": "Strength +2; Dexterity +1",
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/locathah/locathah_main.png",
    "traits": [
      "Natural Armor",
      "Observant & Athletic",
      "Leviathan Will",
      "Limited Amphibiousness"
    ],
    "details": [
      {
        "type": "description",
        "content": "Featured in Ghosts of Saltmarsh, these resilient and proud fish-folk have endured war, slavery, and mistreatment at the hands of other aquatic creatures. They dwell in submerged tribal communities along seacoasts, and hunt both above and below the water."
      }
    ],
    "features": [
      {
        "title": "Natural Armor",
        "description": "You have tough, scaly skin. When you aren't wearing armor, your AC is 12 + your Dexterity modifier. You can use your natural armor to determine your AC if the armor you wear would leave you with a lower AC. A shield's benefits apply as normal while you use your natural armor."
      },
      {
        "title": "Observant & Athletic",
        "description": "You have proficiency in the Athletics and Perception skills."
      },
      {
        "title": "Leviathan Will",
        "description": "You have advantage on saving throws against being charmed, frightened, paralyzed, poisoned, stunned, or put to sleep."
      },
      {
        "title": "Limited Amphibiousness",
        "description": "You can breathe air and water, but you need to be submerged at least once every 4 hours to avoid suffocating."
      }
    ],
    "created_at": "2025-10-23T07:54:52.491+00:00",
    "key": "locathah",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "ce284d5f-de1c-43f0-89b6-654fa554486a",
    "name": "Loxodon",
    "source": "Guildmasters’ Guide to Ravnica",
    "description": "Humanoid elephants, loxodons are strong, calm, and wise.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/loxodon/loxodon.webp",
    "creature_type": "Humanoid",
    "size": "Medium",
    "speed": "30 feet",
    "asi": "Constitution +2; Wisdom +1",
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/loxodon/loxodon_main.png",
    "traits": [
      "Powerful Build",
      "Loxodon Serenity",
      "Natural Armor",
      "Trunk",
      "Keen Smell"
    ],
    "details": [
      {
        "type": "description",
        "content": "The humanoid elephants called loxodons are often oases of calm in the busy streets of Ravnica. They hum or chant in sonorous tones and move slowly or sit in perfect stillness. If provoked to action, loxodons are true terrors—bellowing with rage, trumpeting and flapping their ears. Their serene wisdom, fierce loyalty, and unwavering conviction are tremendous assets to their guilds.\n\nLumbering Giants. \nLoxodons tower above most other humanoids, standing over 7 feet tall. They have the heads—trunks, tusks, ears, and faces—of elephants, and hulking bipedal bodies covered by thick, leathery skin. Each of their hands has four thick digits, and their feet are the flat-bottomed, oval-shaped feet of elephants.\nLike that of an elephant, a loxodon's trunk is a useful appendage. In addition to providing a keen sense of smell, the trunk can be used to lift and carry even heavy objects. The trunk can be used to carry both food and liquid to the mouth and can even act as a snorkel.\n\nGifted Stoneworkers. \nLoxodons are tireless, patient artisans with an unrivaled intuition about their craft. Although they make nurturing spiritual leaders, their gift for stonework is so ingrained that they are often at a loss when they try to impart that knowledge to others. Among the Selesnya, it primarily falls to loxodons to build the guild's magnificent, cathedral-like arboretum structures.\n\nRelentlessly Loyal. \nLoxodons believe in the value of community and life, and thus are most often found in the Selesnya Conclave. Some find fulfillment in the cause of order by joining the Orzhov Syndicate or the Azorius Senate.\nLoxodons believe that the members of a group have a responsibility to look out for each other. Once they have joined a guild or bonded with other individuals in any capacity, loxodons devote themselves to maintaining that bond. They coordinate their efforts and are often willing to sacrifice themselves for the sake of the group. They expect reciprocal loyalty and commitment from the other members of their communities and can be severe in their disappointment when their trust is betrayed.\nThe primary difference between loxodons who join different guilds is their sense of the size of the community they belong to. For loxodons in the Selesnya Conclave, their community is the world and all living beings in it—everything valuable, meant to live in harmony, and interdependent. For Azorius loxodons, community primarily means a society of different peoples who need adherence to law and order so they can function together. For those in the Orzhov Syndicate, community means the syndicate alone, with its interests taking priority over those of any other group.\n\nLoxodon Names. \nA loxodon's name includes subtle tones, produced in a loxodon's resonant nasal chambers, that indicate status, family connection, and community role. Since most non-loxodons can't distinguish these underlying tones, let alone produce them, loxodons often translate them into titles, such as Hierarch, Revered, Grandmother, Healer, or Saint, when interacting with other races."
      },
      {
        "list": [
          "Male Names: Bayul, Berov, Brooj, Chedumov, Dobrun, Droozh, Golomov, Heruj, Ilromov, Kel, Nikoom, Ondros, Radomov, Svetel, Tamuj, Throom, Vasool",
          "Female Names: Ajj, Boja, Dancu, Dooja, Elyuja, Fanoor, Irij, Jasoo, Katrun, Lyooda, Mayja, Radu, Shuja, Soofya, Totoor, Verij, Vesmova, Yoolna, Zarij, Zoorja"
        ],
        "type": "list",
        "content": ""
      }
    ],
    "features": [
      {
        "title": "Powerful Build",
        "description": "You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift."
      },
      {
        "title": "Loxodon Serenity",
        "description": "You have advantage on saving throws against being charmed or frightened."
      },
      {
        "title": "Natural Armor",
        "description": "You have thick, leathery skin. When you aren't wearing armor, your AC is 12 + your Constitution modifier. You can use your natural armor to determine your AC if the armor you wear would leave you with a lower AC. A shield's benefits apply as normal while you use your natural armor.\n\nTip: AC Calculations Don't Stack.\nWhen the game gives you more than one way to calculate your Armor Class, you can use only one of them. You choose the one to use. For example, if you have the loxodon's Natural Armor trait and the monk's Unarmored Defense feature, you don't mix them together. Instead, you choose which one determines your AC."
      },
      {
        "title": "Trunk",
        "description": "You can grasp things with your trunk, and you can use it as a snorkel. It has a reach of 5 feet, and it can lift a number of pounds equal to five times your Strength score. You can use it to do the following simple tasks: lift, drop, hold, push, or pull an object or a creature; open or close a door or a container; grapple someone; or make an unarmed strike. Your DM might allow other simple tasks to be added to that list of options.\n\nYour trunk can't wield weapons or shields or do anything that requires manual precision, such as using tools or magic items or performing the somatic components of a spell."
      },
      {
        "title": "Keen Smell",
        "description": "Thanks to your sensitive trunk, you have advantage on Wisdom (Perception), Wisdom (Survival), and Intelligence (Investigation) checks that involve smell."
      }
    ],
    "created_at": "2025-10-23T07:54:52.965+00:00",
    "key": "loxodon",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "a810659c-f18e-45a6-a256-dd76ca028765",
    "name": "Minotaur",
    "source": "Mordenkainen Presents: Monsters of the Multiverse",
    "description": "Minotaurs are barrel-chested humanoids with heads resembling those of bulls. Blessed with a supernaturally strong sense of direction, minotaurs make great navigators.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/minotaur/minotaur.webp",
    "creature_type": "Humanoid",
    "size": "Medium",
    "speed": "30 feet",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/minotaur/minotaur_main.png",
    "traits": [
      "Horns",
      "Goring Rush",
      "Hammering Horns",
      "Labyrinthine Recall"
    ],
    "details": [
      {
        "type": "description",
        "content": "Minotaurs are barrel-chested humanoids with heads resembling those of bulls. Blessed with a supernaturally strong sense of direction, minotaurs make great navigators. Some sages believe minotaurs were first created by the Lady of Pain to patrol the magical mazes that she uses to trap her foes.\n\nMinotaur horns range in size from about 1 foot long to easily three times that length. Minotaurs often carve their horns to sharpen their edges, etch symbols of power into them, or sheathe them in bronze to prevent them from shattering during battle.\n\nThick hair extends down minotaurs' necks and powerful backs, and some have long patches of hair on their chins and cheeks. Their legs end in heavy, cloven hooves, and they have long, tufted tails."
      }
    ],
    "features": [
      {
        "title": "Horns",
        "description": "You have horns that you can use to make unarmed strikes. When you hit with them, the strike deals 1d6 + your Strength modifier piercing damage, instead of the bludgeoning damage normal for an unarmed strike."
      },
      {
        "title": "Goring Rush",
        "description": "Immediately after you take the Dash action on your turn and move at least 20 feet, you can make one melee attack with your Horns as a bonus action."
      },
      {
        "title": "Hammering Horns",
        "description": "Immediately after you hit a creature with a melee attack as part of the Attack action on your turn, you can use a bonus action to attempt to push that target with your horns. The target must be within 5 feet of you and no more than one size larger than you. Unless it succeeds on a Strength saving throw against a DC equal to 8 + your proficiency bonus + your Strength modifier, you can push it up to 10 feet away from you."
      },
      {
        "title": "Labyrinthine Recall",
        "description": "You always know which direction is north, and you have advantage on any Wisdom (Survival) check you make to navigate or track."
      }
    ],
    "created_at": "2025-10-23T07:54:53.45+00:00",
    "key": "minotaur",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "a11c1288-cd48-4661-bb68-085d6e45322b",
    "name": "Myconid",
    "source": "Kashlava's Collection of Tales",
    "description": "The Myconids are gentle folk born of spore and soil, their quiet forms shaped not by flesh or bone, but by the patient growth of fungi beneath the earth. Neither beast nor plant, they walk as living echoes of the forest, sharing thoughts in silent spores and carrying with them the wisdom of the hidden roots.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/myconid/myconid.webp",
    "creature_type": "Plant",
    "size": "Medium (about 4 to over 6 feet tall, 20-30 pounds (9 to 14 kg))",
    "speed": "30 feet.",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/myconid/myconid_main.png",
    "traits": [
      "Animating Spores",
      "Darkvision",
      "Mycelium Communication",
      "Poisons Shroud"
    ],
    "details": [
      {
        "type": "description",
        "content": "The Myconids are peaceful mushroom-folk who live deep within hidden forests and caverns. They are creatures of patience and quiet thought, grown from the earth rather than born. Connected through clouds of glowing spores, they share emotions and memories without words, forming close, harmonious circles.\n\nTo the Myconids, life and death are simply two parts of the same cycle. They value balance, peace, and understanding above all else. While they avoid conflict, they can be fierce defenders of the natural world when it is threatened.\n\nCalm, thoughtful, and strange to outsiders, the Myconids walk the line between plant and person — living proof that even in the damp darkness, life can dream."
      }
    ],
    "features": [
      {
        "title": "Animating Spores",
        "description": "As an action, you can target one corpse of a humanoid or a Large or smaller beast within 5 feet and releases spores at the corpse. In an 1 minute or just 1 action if you expend 1 charge of Poisons Shroud, the corpse rises as a spore servant(MM p.231). The corpse stays animated for 1d4 + 1 days or until destroyed, and it can't be animated again in this way. Although are you are able to expend a charge of Poisons Shroud to extend the animated servant for 1d4 + 1 days. You can only have one spore servant at a time. You regain spent use of this trait when you complete a long rest."
      },
      {
        "title": "Darkvision",
        "description": "You have Darkvision with a range of 60 feet."
      },
      {
        "title": "Mycelium Communication",
        "description": "You release spores that form a telepathic link between you and up to a number of creatures equal to your level within 60 feet. All linked creatures can communicate telepathically with one another through you, hearing every thought shared in the network. There is no privacy between participants unless you choose to isolate a message. The link lasts for 1 hour, or until you end it as an action."
      },
      {
        "list": [
          ""
        ],
        "table": {
          "rows": [
            [
              "1st level",
              "1d4"
            ],
            [
              "5th level",
              "2d4"
            ],
            [
              "11th level",
              "3d4"
            ],
            [
              "17th level",
              "4d4"
            ]
          ],
          "headers": [
            "Level",
            "Damage Scale"
          ]
        },
        "title": "Poisons Shroud",
        "description": "When you take the Attack action on your turn, you can replace one of your attacks with an exhalation of toxic spores. When you do so, choose one of the following shapes for the spore cloud: a 15-foot cone, or a 30-foot line that is 5 feet wide.\n\nEach creature in the area must make a Constitution saving throw (DC = 8 + your Constitution modifier + your proficiency bonus). On a failed save, a creature takes 1d4 poison damage and becomes 'Spore Bloom' which last until your next turn. Any creature attacking the creature would have advantage. \n\nOn a successful save, the creature takes half as much damage and isn’t 'Spore Bloom'. You can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
      }
    ],
    "created_at": "2025-10-23T07:54:53.917+00:00",
    "key": "myconid",
    "homebrew": true,
    "homebrew_id": ""
  },
  {
    "id": "47347f6a-3d94-420f-8c7a-af7dafceb576",
    "name": "Simic Hybrid",
    "source": "Guildmasters’ Guide to Ravnica",
    "description": "The Simic Combine uses magic to transfer the traits of animals into humans, elves, and vedalken.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/simic_hybrid/simic_hybrid.webp",
    "creature_type": "Humanoid",
    "size": "Medium",
    "speed": "30 feet",
    "asi": "Constitution +2; Choose any other +1",
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/simic_hybrid/simic_hybrid_main.png",
    "traits": [
      "Darkvision",
      "Animal Enhancement"
    ],
    "details": [
      {
        "type": "description",
        "content": "The Simic Combine uses magic to fuse different life forms together. In recent years, the Simic Combine has extended this research to humanoid subjects, magically transferring the traits of various animals into humans, elves, and vedalken. The goal of the Guardian Project is to build a Simic army of soldiers perfectly adapted to a variety of combat situations. These hyper-evolved specimens are called Simic hybrids, though they sometimes refer to themselves as guardians.\n\nExtensive Adaptation. \nA hybrid's biological enhancements can change its appearance drastically, though most hybrids retain their basic physical form. All are augmented with characteristics of animals, mostly aquatic, reptilian, or amphibian creatures. These include crab claws, squid tentacles, wings or fins like those of manta rays, translucent or camouflaged skin, or shark-like maws filled with sharp teeth.\n\nHybrids are the product of Simic magic. It's not impossible for a hybrid to leave the Simic Combine and join another guild, but the Simic would consider the individual a deserter. And the new guild might never fully welcome a hybrid who could easily be a Simic spy.\n\nSimic Hybrid Names.\nA hybrid usually bears the name given by their human, elf, or vedalken parents. Some hybrids assume a new name after their transformation—a name chosen personally or by those who transformed them."
      }
    ],
    "features": [
      {
        "title": "Darkvision",
        "description": "You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
      },
      {
        "list": [
          "Manta Glide. You have ray-like fins that you can use as wings to slow your fall or allow you to glide. When you fall and aren't incapacitated, you can subtract up to 100 feet from the fall when calculating falling damage, and you can move up to 2 feet horizontally for every 1 foot you descend.",
          "Nimble Climber. You have a climbing speed equal to your walking speed.",
          "Underwater Adaptation. You can breathe air and water, and you have a swimming speed equal to your walking speed."
        ],
        "title": "Animal Enhancement",
        "description": "Your body has been altered to incorporate certain animal characteristics. You choose one animal enhancement now and a second enhancement at 5th level.\n\nAt 1st level, choose one of the following options:"
      }
    ],
    "created_at": "2025-10-23T07:54:59.693+00:00",
    "key": "simic_hybrid",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "278375cc-6904-4ccb-94c4-8b14344a9e9d",
    "name": "Orc",
    "source": "Player’s Handbook",
    "description": "Orcs are equipped with gifts to help them wander great plains, vast caverns, and churning seas.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/orc/orc.webp",
    "creature_type": "Humanoid",
    "size": "Medium (about 6-7 feet tall)",
    "speed": "30 feet",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/orc/orc_main.png",
    "traits": [
      "Adrenaline Rush",
      "Darkvision",
      "Relentless Endurance"
    ],
    "details": [
      {
        "type": "description",
        "content": "Orcs trace their creation to Gruumsh, a powerful god who roamed the wide open spaces of the Material Plane. Gruumsh equipped his children with gifts to help them wander great plains, vast caverns, and churning seas and to face the monsters that lurk there. Even when they turn their devotion to other gods, orcs retain Gruumsh's gifts: endurance, determination, and the ability to see in darkness.\n\nOrcs are, on average, tall and broad. They have gray skin, ears that are sharply pointed, and prominent lower canines that resemble small tusks. Orc youths on some worlds are told about their ancestors' great travels and travails. Inspired by those tales, many of those orcs wonder when Gruumsh will call on them to match the heroic deeds of old and if they will prove worthy of his favor. Other orcs are happy to leave old tales in the past and find their own way."
      }
    ],
    "features": [
      {
        "title": "Adrenaline Rush",
        "description": "You can take the Dash action as a Bonus Action. When you do so, you gain a number of Temporary Hit Points equal to your Proficiency Bonus.\nYou can use this trait a number of times equal to your Proficiency Bonus, and you regain all expended uses when you finish a Short or Long Rest."
      },
      {
        "title": "Darkvision",
        "description": "You have Darkvision with a range of 120 feet."
      },
      {
        "title": "Relentless Endurance",
        "description": "When you are reduced to 0 Hit Points but not killed outright, you can drop to 1 Hit Point instead. Once you use this trait, you can't do so again until you finish a Long Rest."
      }
    ],
    "created_at": "2025-10-23T07:54:55.813+00:00",
    "key": "orc",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "9c457c26-cf48-4547-853c-fc9cc8353a5a",
    "name": "Owlin",
    "source": "Strixhaven: A Curriculum of Chaos",
    "description": "Like owls, owlin are graced with feathers that make no sound when they move or fly, making it easy for them to sneak up on you in the library.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/owlin/owlin.webp",
    "creature_type": "Humanoid",
    "size": "Medium",
    "speed": "30 feet, Fly equal to your walking speed",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/owlin/owlin_main.png",
    "traits": [
      "Darkvision",
      "Flight",
      "Silent Feathers"
    ],
    "details": [
      {
        "type": "description",
        "content": "Distant kin of giant owls from the Feywild, owlin come in many shapes and sizes, from petite and fluffy to wide-winged and majestic. Owlin have arms and legs like other Humanoids, as well as wings that extend from their back and shoulders.\n\nLike owls, owlin are graced with feathers that make no sound when they move or fly, making it easy for them to sneak up on you in the library.\n\nYour owlin character might be nocturnal. Or perhaps your character is simply prone to rise later, embodying the common nickname of night owl."
      }
    ],
    "features": [
      {
        "title": "Darkvision",
        "description": "You can see in dim light within 120 feet of yourself as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
      },
      {
        "title": "Flight",
        "description": "Thanks to your wings, you have a flying speed equal to your walking speed. You can't use this flying speed if you're wearing medium or heavy armor."
      },
      {
        "title": "Silent Feathers",
        "description": "You have proficiency in the Stealth skill."
      }
    ],
    "created_at": "2025-10-23T07:54:56.293+00:00",
    "key": "owlin",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "6b837f98-4665-45eb-a3ec-3a639c227d64",
    "name": "Plasmoid",
    "source": "Astral Adventurer’s Guide",
    "description": "Plasmoids are amorphous beings with no typical shape. In the presence of other folk, they often adopt a similar shape, but there’s little chance of mistaking a plasmoid for anything else.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/plasmoid/plasmoid.webp",
    "creature_type": "Ooze",
    "size": "Small or Medium",
    "speed": "30 feet",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/plasmoid/plasmoid_main.png",
    "traits": [
      "Amorphous",
      "Darkvision",
      "Hold Breath",
      "Natural Resilience",
      "Shape Self"
    ],
    "details": [
      {
        "type": "description",
        "content": "Plasmoids are amorphous beings with no typical shape. In the presence of other folk, they often adopt a similar shape, but there's little chance of mistaking a plasmoid for anything else. They consume food by osmosis, the way an amoeba does, and excrete waste through tiny pores. They breathe by absorbing oxygen through another set of pores, and their limbs are strong and flexible enough to grasp and manipulate weapons and tools. Although most plasmoids are translucent gray, they can alter their color and translucence by absorbing dyes through their pores.\n\nPlasmoids don't have internal organs of the usual sort. Their bodies are composed of cells, fibers, plasma-like ooze, and clusters of nerves. These nerves enable a plasmoid to detect light, heat, texture, sound, pain, and vibrations. Plasmoids can stiffen the outer layers of their bodies to maintain a humanlike shape, so they can wear clothing and accessories. They speak by forcing air out of tubular cavities that constrict to produce sound.\n\nWhen plasmoids sleep, they lose their rigidity and spread out and are thus sometimes mistaken for a rock or some other feature of the environment."
      }
    ],
    "features": [
      {
        "title": "Amorphous",
        "description": "You can squeeze through a space as narrow as 1 inch wide, provided you are wearing and carrying nothing. You have advantage on ability checks you make to initiate or escape a grapple."
      },
      {
        "title": "Darkvision",
        "description": "You can see in dim light within 60 feet of yourself as if it were bright light, and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
      },
      {
        "title": "Hold Breath",
        "description": "You can hold your breath for 1 hour."
      },
      {
        "title": "Natural Resilience",
        "description": "You have resistance to acid and poison damage, and you have advantage on saving throws against being poisoned."
      },
      {
        "title": "Shape Self",
        "description": "As an action, you can reshape your body to give yourself a head, one or two arms, one or two legs, and makeshift hands and feet, or you can revert to a limbless blob. While you have a humanlike shape, you can wear clothing and armor made for a Humanoid of your size.\n\nAs a bonus action, you can extrude a pseudopod that is up to 6 inches wide and 10 feet long or reabsorb it into your body. As part of the same bonus action, you can use this pseudopod to manipulate an object, open or close a door or container, or pick up or set down a Tiny object. The pseudopod contains no sensory organs and can't attack, activate magic items, or lift more than 10 pounds."
      }
    ],
    "created_at": "2025-10-23T07:54:56.776+00:00",
    "key": "plasmoid",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "637f8923-07e5-4980-9593-89835ccbc02e",
    "name": "Reborn",
    "source": "Van Richten’s Guide to Ravenloft",
    "description": "Reborn are those returned from death, lingering between life and the grave, sustained by fragments of memory and will.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/reborn/reborn.webp",
    "creature_type": "Humanoid",
    "size": "You are Medium or Small. You choose the size when you gain this lineage.",
    "speed": "30 feet.",
    "asi": "Increase one ability score by 2 and two other scores by 1, or increase three different scores by 1.",
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/reborn/reborn_main.webp",
    "traits": [
      "Ancestral Legacy",
      "Deathless Nature",
      "Knowledge from a Past Life"
    ],
    "details": [
      {
        "type": "description",
        "content": "Death isn’t always the end. The reborn exemplify this, being individuals who have died yet, somehow, still live. Some reborn exhibit the scars of fatal ends, their ashen flesh or bloodless veins making it clear that they’ve been touched by death. Other reborn are marvels of magic or science, being stitched together from disparate beings or bearing mysterious minds in manufactured bodies. Whatever their origins, reborn know a new life and seek experiences and answers all their own."
      },
      {
        "type": "description",
        "content": "Faded Memories :\nReborn suffer from some manner of discontinuity, an interruption of their lives or physical state that their minds are ill equipped to deal with. Their memories of events before this interruption are often vague or absent. Occasionally, the most unexpected experiences might cause sensations or visions of the past to come rushing back.\n\nRather than sleeping, reborn regularly sit and dwell on the past, hoping for some revelation of what came before. Most of the time, these are dark, silent stretches. Occasionally, though, in a moment of peace, stress, or excitement, a reborn gains a glimpse of what came before. When you desire to have such a dreamlike vision, roll on the Lost Memories table to inspire its details."
      },
      {
        "type": "table",
        "table": {
          "rows": [
            [
              "1",
              "You recall a physically painful moment. What mark or scar on your body does it relate to?"
            ],
            [
              "2",
              "A memory brings tears to your eyes. Is it a bitter or cheerful memory? Does recalling it make you feel the same way?"
            ],
            [
              "3",
              "You recall a childhood memory. What about that event or who you were still influences you?"
            ],
            [
              "4",
              "A memory brings with it the voice of someone once close to you. How do they advise you?"
            ],
            [
              "5",
              "You recall enjoying something that you can’t stand doing now. What is it? Why don’t you like it now?"
            ],
            [
              "6",
              "A memory carries a vivid smell or sensation. What are you going to do to recreate that experience?"
            ]
          ],
          "headers": [
            "d6",
            "Memory"
          ]
        },
        "content": ""
      },
      {
        "type": "description",
        "content": "Reborn Origins :\nReborn might originate from circumstances similar to those of various undead or constructs. The Reborn Origins table provides suggestions for how your character became reborn."
      },
      {
        "type": "table",
        "table": {
          "rows": [
            [
              "1",
              "You were magically resurrected, but something went wrong."
            ],
            [
              "2",
              "Stitches bind your body’s mismatched pieces, and your memories come from multiple different lives."
            ],
            [
              "3",
              "After clawing free from your grave, you realized you have no memories except for a single name."
            ],
            [
              "4",
              "You were a necromancer’s undead servant for years. One day, your consciousness returned."
            ],
            [
              "5",
              "You awoke in an abandoned laboratory alongside complex designs for clockwork organs."
            ],
            [
              "6",
              "You were released after being petrified for generations. Your memories have faded, though, and your body isn’t what it once was."
            ],
            [
              "7",
              "Your body hosts a possessing spirit that shares its memories and replaces your missing appendages with phantasmal limbs."
            ],
            [
              "8",
              "In public, you pass as an unremarkable individual, but you can feel the itchy straw stuffing inside you."
            ]
          ],
          "headers": [
            "d8",
            "Origins"
          ]
        },
        "content": ""
      }
    ],
    "features": [
      {
        "title": "Ancestral Legacy",
        "description": "If you replace a race with this lineage, you can keep the following elements of that race: any skill proficiencies you gained from it and any climbing, flying, or swimming speed you gained from it.\n\nIf you don’t keep any of those elements or you choose this lineage at character creation, you gain proficiency in two skills of your choice."
      },
      {
        "list": [
          "You have advantage on saving throws against disease and being poisoned, and you have resistance to poison damage.",
          "You have advantage on death saving throws.",
          "You don’t need to eat, drink, or breathe.",
          "You don’t need to sleep, and magic can’t put you to sleep. You can finish a long rest in 4 hours if you spend those hours in an inactive, motionless state, during which you retain consciousness."
        ],
        "title": "Deathless Nature",
        "description": "You have escaped death, a fact represented by the following benefits:"
      },
      {
        "title": "Knowledge from a Past Life",
        "description": "You temporarily remember glimpses of the past, perhaps faded memories from ages ago or a previous life. When you make an ability check that uses a skill, you can roll a d6 immediately after seeing the number on the d20 and add the number on the d6 to the check. You can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
      }
    ],
    "created_at": "2025-10-23T07:54:57.258+00:00",
    "key": "reborn",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "b1058d03-b1ba-4614-834c-2410f01498c4",
    "name": "Satyr",
    "source": "Mordenkainen Presents: Monsters of the Multiverse",
    "description": "Originating in the Feywild—a realm of pure emotion— satyrs thrive on the energy of merriment.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/satyr/satyr.webp",
    "creature_type": "Fey",
    "size": "Medium (about 6-7 feet tall)",
    "speed": "30 feet",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/satyr/satyr_main.png",
    "traits": [
      "Ram",
      "Magic Resistance",
      "Mirthful Leaps",
      "Reveler"
    ],
    "details": [
      {
        "type": "description",
        "content": "Originating in the Feywild—a realm of pure emotion-satyrs thrive on the energy of merriment. They resemble elves but have goatlike legs, cloven hooves, and ram or goat horns. The magic of the fey realm has given them an innate ability to perform, to delight, and to resist magical intrusion. While they're usually found in the Feywild, satyrs do wander to other planes of existence, most often to the Material Plane. There they seek to bring a bit of their home plane's splendor to other worlds."
      }
    ],
    "features": [
      {
        "title": "Ram",
        "description": "You can use your head and horns to make unarmed strikes. When you hit with them, the strike deals 1d6 + your Strength modifier bludgeoning damage, instead of the bludgeoning damage normal for an unarmed strike."
      },
      {
        "title": "Magic Resistance",
        "description": "You have advantage on saving throws against spells."
      },
      {
        "title": "Mirthful Leaps",
        "description": "Whenever you make a long jump or a high jump, you can roll a d8 and add the number rolled to the number of feet you cover, even when making a standing jump. This extra distance costs movement as usual."
      },
      {
        "title": "Reveler",
        "description": "As an embodiment of revelry, you have proficiency in the Performance and Persuasion skills, and you have proficiency with one musical instrument of your choice."
      }
    ],
    "created_at": "2025-10-23T07:54:57.759+00:00",
    "key": "satyr",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "3481551f-8a72-4e30-bca7-b1b6711eef9e",
    "name": "Sea Elf",
    "source": "Mordenkainen Presents: Monsters of the Multiverse",
    "description": "Sea elves fell in love with the wild beauty of the ocean in the earliest days of the multiverse.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/sea_elf/sea_elf.webp",
    "creature_type": "Humanoid",
    "size": "Medium",
    "speed": "30 feet, Swim equal to your walking speed",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/sea_elf/sea_elf_main.png",
    "traits": [
      "Child of the Sea",
      "Darkvision",
      "Fey Ancestry",
      "Friend of the Sea",
      "Keen Senses",
      "Trance"
    ],
    "details": [
      {
        "type": "description",
        "content": "Sea elves fell in love with the wild beauty of the ocean in the earliest days of the multiverse. While other elves traveled from realm to realm, sea elves navigated the currents and explored the waters of many worlds. Today these elves can be found wherever oceans exist, as well as in the Elemental Plane of Water.\n\nLike other elves, sea elves can live to be over 750 years old."
      },
      {
        "type": "description",
        "content": "Elves of Many Realms\n\nCreated by the god Corellon, the first elves were Fey beings who cavorted on various planes of existence, changing their physical forms at will. Outside the glory of Arvandor, their favorite place was the feywild—a realm of unbridled passion. It was to that place of splendors that elves fled after they were exiled from Corellon's presence for plotting with their god's rival, Lolth. And it was there that they transformed from Fey creatures into Humanoids and lost their ability to shape-shift at will. Afterward, they often wept as they realized what they had lost, their sorrow made even deeper by the Feywild's influence. But in the Feywild, they also discovered the potential joys of being people of fixed forms, and they rediscovered hope once they renounced Lolth's treachery.\n\nMost elves eventually spread from the Feywild to other worlds, as wanderlust and curiosity drove them to the far reaches of the multiverse. In those other worlds, elves developed the physical forms now associated with them. Because of their original mutable nature, each group of elves mystically took on characteristics of the environment with which they bonded, whether forests (wood elves), fey crossings in the Material Plane (high elves), the Underdark (drow), the Shadowfell (shadar-kai), the Feywild (eladrin), or oceans (sea elves).\n\nIn some places, Corellon has passed from elves' memory, but the god's blood flows within them still, even if they know nothing of its source. That blood is what causes them to evolve after spending centuries connected to a particular environment, so it is only a matter of time before other kinds of elves emerge."
      }
    ],
    "features": [
      {
        "title": "Child of the Sea",
        "description": "You can breathe air and water, and you have resistance to cold damage."
      },
      {
        "title": "Darkvision",
        "description": "You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
      },
      {
        "title": "Fey Ancestry",
        "description": "You have advantage on saving throws you make to avoid or end the charmed condition on yourself."
      },
      {
        "title": "Friend of the Sea",
        "description": "Aquatic animals have an extraordinary affinity with your people. You can communicate simple ideas to any Beast that has a swimming speed. It can understand your words, though you have no special ability to understand it in return."
      },
      {
        "title": "Keen Senses",
        "description": "You have proficiency in the Perception skill."
      },
      {
        "title": "Trance",
        "description": "You don't need to sleep, and magic can't put you to sleep. You can finish a long rest in 4 hours if you spend those hours in a trancelike meditation, during which you retain consciousness.\n\nWhenever you finish this trance, you can gain two proficiencies that you don't have, each one with a weapon or a tool of your choice selected from the Player's Handbook. You mystically acquire these proficiencies by drawing them from shared elven memory, and you retain them until you finish your next long rest."
      }
    ],
    "created_at": "2025-10-23T07:54:58.229+00:00",
    "key": "sea_elf",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "c52b6c1d-a600-4183-9f51-429f3bd19263",
    "name": "Shadar Kai",
    "source": "Mordenkainen Presents: Monsters of the Multiverse",
    "description": "Once shadar-kai were Fey like the rest of their elven kin; now they exist in a state between life and death, thanks to being transformed by the Shadowfell.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/shadar_kai/shadar_kai.webp",
    "creature_type": "Humanoid",
    "size": "Medium",
    "speed": "30 feet",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/shadar_kai/shadar_kai_main.png",
    "traits": [
      "Blessing of the Raven Queen",
      "Darkvision",
      "Fey Ancestry",
      "Keen Senses",
      "Necrotic Resistance",
      "Trance"
    ],
    "details": [
      {
        "type": "description",
        "content": "Shadar-kai are the elves of the Shadowfell, originally drawn to that dread realm by the Raven Queen. Over the centuries, some of them have continued to serve her, while others have ventured into the Material Plane to forge their own destinies.\n\nOnce shadar-kai were Fey like the rest of their elven kin; now they exist in a state between life and death, thanks to being transformed by the Shadowfell's grim energy.\n\nShadar-kai have ashen skin tones, and while they're in the Shadowfell, they also become wizened, reflecting the somber nature of that gloomy plane.\n\nLike other elves, shadar-kai can live to be over 750 years old."
      },
      {
        "type": "description",
        "content": "Elves of Many Realms\n\nCreated by the god Corellon, the first elves were Fey beings who cavorted on various planes of existence, changing their physical forms at will. Outside the glory of Arvandor, their favorite place was the feywild—a realm of unbridled passion. It was to that place of splendors that elves fled after they were exiled from Corellon's presence for plotting with their god's rival, Lolth. And it was there that they transformed from Fey creatures into Humanoids and lost their ability to shape-shift at will. Afterward, they often wept as they realized what they had lost, their sorrow made even deeper by the Feywild's influence. But in the Feywild, they also discovered the potential joys of being people of fixed forms, and they rediscovered hope once they renounced Lolth's treachery.\n\nMost elves eventually spread from the Feywild to other worlds, as wanderlust and curiosity drove them to the far reaches of the multiverse. In those other worlds, elves developed the physical forms now associated with them. Because of their original mutable nature, each group of elves mystically took on characteristics of the environment with which they bonded, whether forests (wood elves), fey crossings in the Material Plane (high elves), the Underdark (drow), the Shadowfell (shadar-kai), the Feywild (eladrin), or oceans (sea elves).\n\nIn some places, Corellon has passed from elves' memory, but the god's blood flows within them still, even if they know nothing of its source. That blood is what causes them to evolve after spending centuries connected to a particular environment, so it is only a matter of time before other kinds of elves emerge."
      }
    ],
    "features": [
      {
        "title": "Blessing of the Raven Queen",
        "description": "As a bonus action, you can magically teleport up to 30 feet to an unoccupied space you can see. You can use this trait a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.\n\nStarting at 3rd level, you also gain resistance to all damage when you teleport using this trait. The resistance lasts until the start of your next turn. During that time, you appear ghostly and translucent."
      },
      {
        "title": "Darkvision",
        "description": "You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
      },
      {
        "title": "Fey Ancestry",
        "description": "You have advantage on saving throws you make to avoid or end the charmed condition on yourself."
      },
      {
        "title": "Keen Senses",
        "description": "You have proficiency in the Perception skill."
      },
      {
        "title": "Necrotic Resistance",
        "description": "You have resistance to necrotic damage."
      },
      {
        "title": "Trance",
        "description": "You don't need to sleep, and magic can't put you to sleep. You can finish a long rest in 4 hours if you spend those hours in a trancelike meditation, during which you retain consciousness.\n\nWhenever you finish this trance, you can gain two proficiencies that you don't have, each one with a weapon or a tool of your choice selected from the Player's Handbook. You mystically acquire these proficiencies by drawing them from shared elven memory, and you retain them until you finish your next long rest."
      }
    ],
    "created_at": "2025-10-23T07:54:58.721+00:00",
    "key": "shadar-kai",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "aad48eb0-43ef-4bc1-9874-c241335c79d1",
    "name": "Shifter",
    "source": "Mordenkainen Presents: Monsters of the Multiverse",
    "description": "Humanoids with a bestial aspect, shifters can’t fully change shape, but they can temporarily enhance their animalistic features by entering a state they call shifting.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/shifter/shifter.webp",
    "creature_type": "Humanoid",
    "size": "Medium",
    "speed": "30 feet",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/shifter/shifter_main.png",
    "traits": [
      "Bestial Instincts",
      "Darkvision",
      "Shifting"
    ],
    "details": [
      {
        "type": "description",
        "content": "Shifters are sometimes called weretouched, as they are descendants of people who contracted full or partial lycanthropy. Humanoids with a bestial aspect, shifters can't fully change shape, but they can temporarily enhance their animalistic features by entering a state they call shifting.\n\nShifters are similar to humans in height and build but are typically more lithe and flexible. Their facial features have a bestial cast, often with large eyes and pointed ears; most shifters also have prominent canine teeth. They grow fur-like hair on nearly every part of their bodies. While a shifter's appearance might remind an onlooker of an animal, they remain clearly identifiable as shifters even when at their most feral.\n\nMost shifters resemble a particular kind of lycanthrope. You can choose the kind of lycanthrope in your past, or you can determine it randomly by rolling on the Lycanthrope Ancestor table. The table also provides a suggestion for the Shifting option you might have as a result of your ancestry."
      },
      {
        "type": "table",
        "table": {
          "rows": [
            [
              "1",
              "Werebear",
              "Beasthide"
            ],
            [
              "2",
              "Werebear",
              "Beasthide"
            ],
            [
              "3",
              "Wererat",
              "Swiftstride"
            ],
            [
              "4",
              "Weretiger",
              "Swiftstride"
            ],
            [
              "5",
              "Werewolf (wolflike)",
              "Longtooth"
            ],
            [
              "6",
              "Werewolf (doglike)",
              "Wildhunt"
            ]
          ],
          "headers": [
            "d6",
            "Ancestor",
            "Suggested Shifting Option"
          ]
        },
        "content": ""
      }
    ],
    "features": [
      {
        "title": "Bestial Instincts",
        "description": "Channeling the beast within, you have proficiency in one of the following skills of your choice: Acrobatics, Athletics, Intimidation, or Survival."
      },
      {
        "title": "Darkvision",
        "description": "You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were in dim light. You discern colors in that darkness only as shades of gray."
      },
      {
        "list": [
          "Beasthide. You gain 1d6 additional temporary hit points. While shifted, you have a +1 bonus to your Armor Class.",
          "Longtooth. When you shift and as a bonus action on your other turns while shifted, you can use your elongated fangs to make an unarmed strike. If you hit with your fangs, you can deal piercing damage equal to 1d6 + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike.",
          "Swiftstride. While shifted, your walking speed increases by 10 feet. Additionally, you can move up to 10 feet as a reaction when a creature ends its turn within 5 feet of you. This reactive movement doesn't provoke opportunity attacks.",
          "Wildhunt. While shifted, you have advantage on Wisdom checks, and no creature within 30 feet of you can make an attack roll with advantage against you unless you're incapacitated."
        ],
        "title": "Shifting",
        "description": "As a bonus action, you can assume a more bestial appearance. This transformation lasts for 1 minute, until you die, or until you revert to your normal appearance as a bonus action. When you shift, you gain temporary hit points equal to 2 × your proficiency bonus. You can shift a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.\n\nWhenever you shift, you gain an additional benefit based on one of the following options (choose when you select this race):"
      }
    ],
    "created_at": "2025-10-23T07:54:59.212+00:00",
    "key": "shifter",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "4ac581c7-cd8e-4353-b181-3466271220a4",
    "name": "Thri Kreen",
    "source": "Astral Adventurer’s Guide",
    "description": "Thri-kreen speak by clacking their mandibles and waving their antennae, indicating what they are thinking and feeling.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/thri_kreen/thri_kreen.webp",
    "creature_type": "Monstrosity",
    "size": "Medium",
    "speed": "30 feet",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/thri_kreen/thri_kreen_main.png",
    "traits": [
      "Chameleon Carapace",
      "Darkvision",
      "Secondary Arms",
      "Sleepless",
      "Thri-kreen Telepathy"
    ],
    "details": [
      {
        "type": "description",
        "content": "Thri-kreen have insectile features and two pairs of arms. Their bodies are encased in protective chitin. They can alter the coloration of this carapace to blend in with their natural surroundings.\n\nAlthough thri-kreen don't sleep, they do require periods of inactivity to revitalize themselves. During these periods, they are fully aware of what's happening around them.\n\nThri-kreen speak by clacking their mandibles and waving their antennae, indicating to other thri-kreen what they are thinking and feeling. Other creatures find this method of communication difficult to interpret and impossible to duplicate. To interact with other folk, thri-kreen rely on a form of telepathy."
      }
    ],
    "features": [
      {
        "title": "Chameleon Carapace",
        "description": "While you aren't wearing armor, your carapace gives you a base Armor Class of 13 + your Dexterity modifier.\n\nAs an action, you can change the color of your carapace to match the color and texture of your surroundings, giving you advantage on Dexterity (Stealth) checks made to hide in those surroundings."
      },
      {
        "title": "Darkvision",
        "description": "You can see in dim light within 60 feet of yourself as if it were bright light, and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
      },
      {
        "title": "Secondary Arms",
        "description": "You have two slightly smaller secondary arms below your primary pair of arms. The secondary arms can manipulate an object, open or close a door or container, pick up or set down a Tiny object, or wield a weapon that has the light property."
      },
      {
        "title": "Sleepless",
        "description": "You do not require sleep and can remain conscious during a long rest, though you must still refrain from strenuous activity to gain the benefit of the rest."
      },
      {
        "title": "Thri-kreen Telepathy",
        "description": "Without the assistance of magic, you can't speak the non-thri-kreen languages you know. Instead you use telepathy to convey your thoughts. You have the magical ability to transmit your thoughts mentally to willing creatures within 120 feet of yourself. A contacted creature doesn't need to share a language with you to understand your thoughts, but it must be able to understand at least one language. Your telepathic link to a creature is broken if you and the creature move more than 120 feet apart, if either of you is incapacitated, or if either of you mentally breaks the contact (no action required)."
      }
    ],
    "created_at": "2025-10-23T07:55:00.644+00:00",
    "key": "thri_kreen",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "a4184410-1e8f-4080-b871-1c9209a88924",
    "name": "Tiefling",
    "source": "Player’s Handbook",
    "description": "Tieflings are either born in the Lower Planes or have fiendish ancestors who originated there.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/tiefling/tiefling.webp",
    "creature_type": "Humanoid",
    "size": "Medium (about 4-7 feet tall) or Small (about 3-4 feet tall), chosen when you select this species",
    "speed": "30 feet",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/tiefling/tiefling_main.png",
    "traits": [
      "Darkvision",
      "Fiendish Legacy",
      "Otherworldly Presence"
    ],
    "details": [
      {
        "type": "description",
        "content": "Tieflings are either born in the Lower Planes or have fiendish ancestors who originated there. A tiefling (pronounced TEE-fling) is linked by blood to a devil, a demon, or some other Fiend. This connection to the Lower Planes is the tiefling's fiendish legacy, which comes with the promise of power yet has no effect on the tiefling's moral outlook.\n\nA tiefling chooses whether to embrace or lament their fiendish legacy. The three legacies are described below.\n\nAbyssal\nThe entropy of the Abyss, the chaos of Pandemonium, and the despair of Carceri call to tieflings who have the abyssal legacy. Horns, fur, tusks, and peculiar scents are common physical features of such tieflings, most of whom have the blood of demons coursing through their veins.\n\nChthonic\nTieflings who have the chthonic legacy feel not only the tug of Carceri but also the greed of Gehenna and the gloom of Hades. Some of these tieflings look cadaverous. Others possess the unearthly beauty of a succubus, or they have physical features in common with a night hag, a yugoloth, or some other Neutral Evil fiendish ancestor.\n\nInfernal\nThe infernal legacy connects tieflings not only to Gehenna but also the Nine Hells and the raging battlefields of Acheron. Horns, spines, tails, golden eyes, and a faint odor of sulfur or smoke are common physical features of such tieflings, most of whom trace their ancestry to devils."
      }
    ],
    "features": [
      {
        "title": "Darkvision",
        "description": "You have Darkvision with a range of 60 feet."
      },
      {
        "table": {
          "rows": [
            [
              "Abyssal",
              "You have Resistance to Poison damage. You also know the Poison Spray cantrip.",
              "Ray of Sickness",
              " Sickness\tHold Person"
            ],
            [
              "Chthonic",
              "You have Resistance to Necrotic damage. You also know the Chill Touch cantrip.",
              "False Life",
              "Ray of Enfeeblement"
            ],
            [
              "Infernal",
              "You have Resistance to Fire damage. You also know the Fire Bolt cantrip.",
              "Hellish Rebuke",
              "Darkness"
            ]
          ],
          "headers": [
            "Legacy",
            "Level 1",
            "Level 3",
            "Level 5"
          ]
        },
        "title": "Fiendish Legacy",
        "description": "You are the recipient of a legacy that grants you supernatural abilities. Choose a legacy from the Fiendish Legacies table. You gain the level 1 benefit of the chosen legacy.\n\nWhen you reach character levels 3 and 5, you learn a higher-level spell, as shown on the table. You always have that spell prepared. You can cast it once without a spell slot, and you regain the ability to cast it in that way when you finish a Long Rest. You can also cast the spell using any spell slots you have of the appropriate level. Intelligence, Wisdom, or Charisma is your spellcasting ability for the spells you cast with this trait (choose the ability when you select the legacy)."
      },
      {
        "title": "Otherworldly Presence",
        "description": "You know the Thaumaturgy cantrip. When you cast it with this trait, the spell uses the same spellcasting ability you use for your Fiendish Legacy Trait."
      }
    ],
    "created_at": "2025-10-23T07:55:01.114+00:00",
    "key": "tiefling",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "c791bd24-1e37-4909-bf6b-ce62f3ca7cda",
    "name": "Tortle",
    "source": "Mordenkainen Presents: Monsters of the Multiverse",
    "description": "Carrying their shelter on their backs gives tortles a special feeling of security wherever they go, for even if they visit a far, unknown country, they have a place to lay their heads.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/tortle/tortle.webp",
    "creature_type": "Humanoid",
    "size": "Small or Medium",
    "speed": "30 feet",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/tortle/tortle_main.png",
    "traits": [
      "Claws",
      "Hold Breath",
      "Natural Armor",
      "Nature’s Intuition",
      "Shell Defense"
    ],
    "details": [
      {
        "type": "description",
        "content": "Tortles have a saying: \"We wear our homes on our backs.\" These turtle folk live on many worlds, most often journeying up and down coasts, along waterways, and across the sea. Tortles don't have a unified story of how they were created, but they all have a sense of being mystically connected to the natural world. Carrying their shelter on their backs gives tortles a special feeling of security wherever they go, for even if they visit a far, unknown country, they have a place to lay their heads.\n\nTortles exhibit the same range of coloration and patterns found among turtles, and many tortles enjoy adorning their shells in distinctive ways."
      }
    ],
    "features": [
      {
        "title": "Claws",
        "description": "You have claws that you can use to make unarmed strikes. When you hit with them, the strike deals 1d6 + your Strength modifier slashing damage, instead of the bludgeoning damage normal for an unarmed strike."
      },
      {
        "title": "Hold Breath",
        "description": "You can hold your breath for up to 1 hour."
      },
      {
        "title": "Natural Armor",
        "description": "Your shell provides you a base AC of 17 (your Dexterity modifier doesn't affect this number). You can't wear light, medium, or heavy armor, but if you are using a shield, you can apply the shield's bonus as normal."
      },
      {
        "title": "Nature’s Intuition",
        "description": "Thanks to your mystical connection to nature, you gain proficiency with one of the following skills of your choice: Animal Handling, Medicine, Nature, Perception, Stealth, or Survival."
      },
      {
        "title": "Shell Defense",
        "description": "You can withdraw into your shell as an action. Until you emerge, you gain a +4 bonus to your AC, and you have advantage on Strength and Constitution saving throws. While in your shell, you are prone, your speed is 0 and can't increase, you have disadvantage on Dexterity saving throws, you can't take reactions, and the only action you can take is a bonus action to emerge from your shell."
      }
    ],
    "created_at": "2025-10-23T07:55:01.585+00:00",
    "key": "tortle",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "e7116524-1dec-463f-845e-7c2e7d7e6dc3",
    "name": "Triton",
    "source": "Mordenkainen Presents: Monsters of the Multiverse",
    "description": "Over time, triton have extended their stewardship over the sea floor to the ocean’s surface.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/triton/triton.webp",
    "creature_type": "Humanoid",
    "size": "Medium",
    "speed": "30 feet, Swim equal to your walking speed",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/triton/triton_main.png",
    "traits": [
      "Amphibious",
      "Control Air and Water",
      "Darkvision",
      "Emissary of the Sea",
      "Guardian of the Depths"
    ],
    "details": [
      {
        "type": "description",
        "content": "Originally from the Elemental Plane of Water, many tritons entered the Material Plane centuries ago in response to the growing threat of evil elementals. Those tritons spread across the worlds' oceans, protecting the surface from terrors in the deep. Over time, triton have extended their stewardship over the sea floor to the ocean's surface.\n\nTritons have webbed hands and feet, small fins on their calves, and coloration that favors blues and greens."
      }
    ],
    "features": [
      {
        "title": "Amphibious",
        "description": "You can breathe air and water."
      },
      {
        "title": "Control Air and Water",
        "description": "You can cast fog cloud with this trait. Starting at 3rd level, you can cast the gust of wind spell with this trait. Starting at 5th level, you can also cast the water walk spell with it. Once you cast any of these spells with this trait, you can't cast that spell with it again until you finish a long rest. You can also cast these spells using any spell slots you have of the appropriate level.\n\nIntelligence, Wisdom, or Charisma is your spellcasting ability for these spells when you cast them with this trait (choose when you select this race)."
      },
      {
        "title": "Darkvision",
        "description": "You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
      },
      {
        "title": "Emissary of the Sea",
        "description": "You can communicate simple ideas to any Beast, Elemental, or Monstrosity that has a swimming speed. It can understand your words, though you have no special ability to understand it in return."
      },
      {
        "title": "Guardian of the Depths",
        "description": "Adapted to the frigid ocean depths, you have resistance to cold damage."
      }
    ],
    "created_at": "2025-10-23T07:55:02.054+00:00",
    "key": "triton",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "6980c8bc-ea1f-4ac3-8a59-aa57fc61a395",
    "name": "Vedalken",
    "source": "Guildmasters’ Guide to Ravnica",
    "description": "The blue-skinned vedalken strive for perfection above all else.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/vedalken/vedalken.webp",
    "creature_type": "Humanoid",
    "size": "Medium",
    "speed": "30 feet",
    "asi": "Intelligence +2; Wisdom +1",
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/vedalken/vedalken_main.png",
    "traits": [
      "Vedalken Dispassion",
      "Tireless Precision",
      "Partially Amphibious"
    ],
    "details": [
      {
        "type": "description",
        "content": "Nothing is perfect. Vedalken not only believe this fact, they rejoice in it. Every imperfection is a chance for improvement, and progress is an endless march toward a state of perfection that can never be reached. This viewpoint leads vedalken to pursue their work with delighted enthusiasm, never deterred by setbacks and excited by every opportunity for improvement.\n\nVedalken are tall and slender, standing almost a head taller than humans on average but weighing about the same. Their hairless skin comes in a range of shades of blue. Their eyes are darker shades of blue or violet. They lack external ears, their noses are broad and flat, and they are partially amphibious.\n\nCool Rationality. \nDespite being talkative, vedalken keep their personal lives private, and they tend to engage more with ideas than with people. They form close friendships based on mutual interests or compelling disagreements, and their interactions dwell on their thoughts about those issues rather than their feelings about them.\nTo members of other races, vedalken often seem cold, even emotionless. That assessment isn't fair—they feel emotion every bit as intensely as other folk do, but they are skilled at not displaying it. Cool rationality guides their actions, they make and follow careful plans, and they are patient enough to do nothing when the ideal outcome relies on such inaction.\n\nReasoning toward Perfection. \nTheir curious intellects and rational minds incline vedalken toward membership in the Azorius Senate, the Simic Combine, and (less often) the Izzet League. Whatever their guild affiliation, they put their intelligence to use in crafting and improving things, whether those things are laws, procedures, or magical sciences.\nVedalken believe that the path toward the impossible goal of perfection is paved with bricks of education, careful deliberation, and controlled experimentation. Some vedalken direct their energy toward perfecting themselves, whether by means of Simic bioengineering or through extensive study, and others concentrate on perfecting society through the careful drafting and application of laws.\n\nVedalken Names. \nVedalken are given names at birth, but usually choose new names for themselves as part of their transition into adulthood. They rarely use family names."
      },
      {
        "list": [
          "Male Names: Aglar, Bellin, Dallid, Firellan, Kavin, Koplony, Lomar, Mathvan, Modar, Nebun, Nhillosh, Nitt, Otrovac, Ovlan, Pelener, Rill, Trivaz, Uldin, Yolov, Zataz",
          "Female Names: Azi, Barvisa, Brazia, Direll, Fainn, Griya, Hallia, Katrille, Kovel, Lilla, Mirela, Morai, Nedress, Ossya, Pierenn, Roya, Sestri, Triel, Uzana, Yaraghiya, Zlovol"
        ],
        "type": "list",
        "content": ""
      }
    ],
    "features": [
      {
        "title": "Vedalken Dispassion",
        "description": "You have advantage on all Intelligence, Wisdom, and Charisma saving throws."
      },
      {
        "title": "Tireless Precision",
        "description": "You are proficient in one of the following skills of your choice: Arcana, History, Investigation, Medicine, Performance, or Sleight of Hand. You are also proficient with one tool of your choice.\n\nWhenever you make an ability check with the chosen skill or tool, roll a d4 and add the number rolled to the check's total."
      },
      {
        "title": "Partially Amphibious",
        "description": "By absorbing oxygen through your skin, you can breathe underwater for up to 1 hour. Once you've reached that limit, you can't use this trait again until you finish a long rest."
      }
    ],
    "created_at": "2025-10-23T07:55:02.548+00:00",
    "key": "vedalken",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "8d59a2b5-df16-4577-ba74-7ffc0e5d2780",
    "name": "Verdan",
    "source": "Acquisitions Incorporated",
    "description": "The verdan owe their existence to chaos - doing their best to find their way in an unfamiliar world.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/verdan/verdan.webp",
    "creature_type": "Humanoid",
    "size": "Varies. Verdan start out similar in size to the goblins they were created from, ranging from 3 to 4 feet in height. But at some point after reaching maturity, each verdan undergoes a sudden growth spurt of 2 feet or more. At 1st level, you are a Small creature. When you reach 5th level, you become a Medium creature.",
    "speed": "30 feet",
    "asi": "Charisma +2; Constitution +1",
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/verdan/verdan_main.png",
    "traits": [
      "Black Blood Healing",
      "Limited Telepathy",
      "Persuasive",
      "Telepathic Insight"
    ],
    "details": [
      {
        "type": "description",
        "content": "The verdan owe their existence to chaos. Descended and transformed from a large clan of goblins and hobgoblins, those who became the verdan were simply living their lives, doing goblinoid things. But then passing through the shadow of That-Which-Endures changed them forever. Now the newest race to call Faerûn home, the verdan do their best to find their way in an unfamiliar world.\n\n“Reality is a descent into chaos punctuated by brief flashes of order, whence we arose and so imagine it to be the norm rather than a distant outlier. That-Which-Endures held entropy back for a mere instant, and the Verdan emerged. I'm sorry, was that the question?”\n\n— K'thriss Drow'b\n\nCreated by Chaos. When the power of That-Which-Endures mutated the verdan, their skin was turned the color of jade and their blood began to flow black. Their ears grew pointed, and they gained a limited form of telepathy—but at the cost of forgetting their history. The underground homes of the goblins were places of terror to the new creatures those goblins became, and the verdan quickly fled to the surface and into the sunlight.\n\nWhen they arrived in the new lands of the surface, the verdan found that they were often mistaken for smaller, green-skinned half-elves. Attracting curiosity but no real questions, they have thus been able to make their way reasonably freely in the world."
      },
      {
        "type": "description",
        "content": "That-Which-Endures\nThat-Which-Endures is a nameless, faceless, mysterious entity, something between a multiverse-spanning primordial spirit and an over-god. It represents the amoral and all-encompassing power of entropy—the force that unknowingly and uncaringly changes order into chaos, and that breaks matter and time down into its component parts so that all can be rebuilt. Some who study this entity claim that it is clearly evil and destructive. Others call it simply a necessary part of the cycle of death and rebirth. In the end, though, That-Which-Endures shows precious little interest in what people say about it."
      },
      {
        "type": "description",
        "content": "Ongoing Mutations. Because the verdan have not dwelled long in the world, they are still discovering new things about themselves. Chief among these discoveries is that their physical forms change as they age, signifying that the mutative power of That-Which-Endures is not done with them. The first verdan emerged from the Underdark as creatures of goblin stature. But they soon learned that their kind were fated to eventually undergo a dramatic, painful, and random growth spurt that sees them transformed to hobgoblin size over a period of days.\n\nAt the same time, many verdan undergo changes in coloring as they age. Male verdan typically have little to no hair, while females sport shocks of wiry hair that they try to tame in a variety of styles. But the color of any verdan's hair, skin, and eyes can transform from their original jade tones to pale white, deep ebon, or any other shade in between. A verdan's ears also undergo numerous spontaneous alterations over their lifetime, from the typical range of point and peak seen among the elves, to huge ears that sweep back from the head like wings, and which are often pierced behind the head with a single ring to keep them from flapping about.\n\nChanges in gender are also a known and accepted part of verdan life. These fluid aspects of form and identity are seen as blessings, allowing an individual to experience more of the world and grow in empathy and understanding. There is no pattern to any verdan's mutations, as verdan from the same family can shift in drastically different ways. The verdan assign no cultural or biological relevance to any particular coloration, physical features, or gender.\n\nCultural Chameleons. The clan homes of the Underdark goblinoids who became the verdan covered an enormous area. As the verdan fled to the surface world, they emerged in culturally diverse locations. Some found themselves near dwarven strongholds, others near elven enclaves, and others near the widespread human settlements of Faerûn.\n\nWithout a cultural identity or memory of their own, the verdan quickly adopted the cultural practices of the areas into which they migrated. Still, a sense of not truly belonging is felt even by verdan who have been welcomed into other cultures. They are often stricken with wanderlust, keeping their possessions limited and easily portable. It is not unusual to see individual verdan or whole families trooping along the roads of the world with their tents and belongings strapped to their backs.\n\nEven when they are happily steeped in a culture, the verdan remain on the lookout for oppression and curtailment of freedoms. They understand the need for laws that protect, but they rail against laws that restrict and oppress—especially those designed to protect the power and wealth of the elite. When living among enlightened folk, verdan are still the first to speak out against cultural restraints on individuals, particularly those based on physical characteristics such as gender, race, or appearance.\n\nWide-Eyed and Curious. Verdan are hungry to undertake new challenges and absorb new experiences. When they meet other verdan who have traveled to different parts of the world, they drop everything to spend as long as possible sharing stories and observations from their respective travels. However, their inexperience in the world and their racial amnesia sometimes lends the verdan a kind of innocence that works against them. Some are credulous and easily fooled by hucksters, but most verdan have an intuition bred by empathy that helps them eventually sort out those who are sincere from those who are not.\n\nVerdan Names. The oldest verdan names spring from goblinoid traditions, but more recent names reflect the character of the different cultures these folk have encountered since coming out into the sunlight. When a group of verdan live near dwarves, they might take on more dwarven-sounding names, only to change those names when they wander into a human area. A verdan is also not hesitant to change their name as their physical appearance changes—or, indeed, whenever the mood strikes them.\n\nVerdan make no differentiation between male, female, and family names, and often eschew family names altogether.\n\nVerdan Names: Bronn, Crahma, Dolar, Dreeda, Duglee, Gruvald, Hulm, Jeal, Kalo, Klesh, Korm, Lathi, Ovlig, Paracii, Pils, Praet, Promul, Reezni, Rin, Shylk, Slyra, Sollo, Stalsii, Stromvo, Stussa, Syrkart, Takat, Toit, Tubyna, Varr, Veriga, Wraq, Wural, Wurxee\n\nUnderlying Improvements\nWhen a verdan character gains an ability score improvement at certain levels, that increase can be tied to a physical mutation at the player's determination. A boost to Strength might be accompanied by a growth spurt and the development of rippling muscle, while an increase in Intelligence might produce a stylishly large forehead."
      }
    ],
    "features": [
      {
        "title": "Black Blood Healing",
        "description": "The black blood that is a sign of your people's connection to That-Which-Endures boosts your natural healing. When you roll a 1 or 2 on any Hit Die you spend at the end of a short rest, you can reroll the die and must use the new roll."
      },
      {
        "title": "Limited Telepathy",
        "description": "You can telepathically speak to any creature you can see within 30 feet of you. You don't need to share a language with the creature for it to understand your telepathy, but it must be able to understand at least one language. This process of communication is slow and limited, allowing you to transmit and receive only simple ideas and straightforward concepts."
      },
      {
        "title": "Persuasive",
        "description": "Your people's lack of history makes you trustworthy and humble. You have proficiency in the Persuasion skill."
      },
      {
        "title": "Telepathic Insight",
        "description": "Your mind's connection to the world around you strengthens your will. You have advantage on all Wisdom and Charisma saving throws."
      }
    ],
    "created_at": "2025-10-23T07:55:03.024+00:00",
    "key": "verdan",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "5a5b01e2-605b-4c33-8e1b-cd3cf66f6f0c",
    "name": "Warforged",
    "source": "Eberron: Rising from the Last War",
    "description": "Warforged are made from wood and metal, but they can feel pain and emotion. Built as weapons, they must now find a purpose beyond war.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/warforged/warforged.webp",
    "creature_type": "Humanoid",
    "size": "Medium",
    "speed": "30 feet",
    "asi": "Constitution +2; Choose any other +1",
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/warforged/warforged_main.png",
    "traits": [
      "Constructed Resilience",
      "Sentry's Rest",
      "Integrated Protection",
      "Specialized Design"
    ],
    "details": [
      {
        "type": "description",
        "content": "\"Pierce was built by design, while you were built by accident,\" Lakashtai said. \"The soul is what matters, not the shape of the vessel.\"\n\n\"What makes you think he has a soul?\" Gerrion said\n\n\"What makes you think you do?\"\n\n— Keith Baker, The Shattered Land\n\nThe warforged were built to fight in the Last War. While the first warforged were mindless automatons, House Cannith devoted vast resources to improving these steel soldiers. An unexpected breakthrough produced sapient soldiers, giving rise to what some have only grudgingly accepted as a new species. Warforged are made from wood and metal, but they can feel pain and emotion. Built as weapons, they must now find a purpose beyond war. A warforged can be a steadfast ally, a cold-hearted killer, or a visionary in search of meaning.\n\nLiving Steel and Stone. Warforged are formed from a blend of organic and inorganic materials. Root-like cords infused with alchemical fluids serve as their muscles, wrapped around a framework of steel, darkwood, or stone. Armored plates form a protective outer shell and reinforce joints. Warforged share a common facial design, with a hinged jaw and crystal eyes embedded beneath a reinforced brow ridge. Beyond these common elements of warforged design, the precise materials and build of a warforged vary based on the purpose for which it was designed.\n\nAlthough they were manufactured, warforged are living humanoids. Resting, healing magic, and the Medicine skill all provide the same benefits to warforged that they do to other humanoids.\n\nWarforged Personality. The warforged were built to serve and to fight. For most of their existence, warforged had a clearly defined function and were encouraged to focus purely on that role. The Treaty of Thronehold gave them freedom, but many still struggle both to find a place in the post-war world and to relate to the creatures who created them.\n\nThe typical warforged shows little emotion. Many warforged embrace a concrete purpose—such as protecting allies, completing a contract, or exploring a land—and embrace this task as they once did war. However, there are warforged who delight in exploring their feelings, their freedom, and their relationships with others. Most warforged have no interest in religion, but some embrace faith and mysticism, seeking higher purpose and deeper meaning.\n\nThe typical warforged has a sexless body shape. Some warforged ignore the concept of gender entirely, while others adopt a gender identity.\n\nThe more a warforged develops its individuality, the more likely it is to modify its body, seeking out an artificer to customize the look of its face, limbs, and plating.\n\nQuirks. Warforged often display an odd personality trait or two, given how new they are to the world. The Warforged Quirks table contains example quirks.\n\nWarforged Quirks"
      },
      {
        "type": "table",
        "table": {
          "rows": [
            [
              "1",
              "You analyze—out loud—the potential threat posed by every creature you meet."
            ],
            [
              "2",
              "You often misread emotional cues."
            ],
            [
              "3",
              "You are fiercely protective of your friends."
            ],
            [
              "4",
              "You try to apply wartime discipline to every situation."
            ],
            [
              "5",
              "You don't know how to filter your feelings and are prone to dramatic emotional outbursts."
            ],
            [
              "6",
              "You don't understand clothing beyond its utility and assume it denotes a person's function."
            ],
            [
              "7",
              "You are obsessed with your appearance and constantly polish and buff yourself."
            ],
            [
              "8",
              "War is the only thing that makes sense to you, and you're always looking for a fight."
            ]
          ],
          "headers": [
            "d8",
            "Quirk"
          ]
        },
        "content": ""
      },
      {
        "type": "description",
        "content": "Warforged Names. Most warforged were assigned numerical designations for use in military service. Many of them adopted nicknames, often given to them by their comrades. As independent individuals, some have chosen new names as a way to express their path in life. A few take on human names, often the name of a fallen friend or mentor.\n"
      },
      {
        "list": [
          "Warforged Names: Anchor, Banner, Bastion, Blade, Blue, Bow, Cart, Church, Crunch, Crystal, Dagger, Dent, Five, Glaive, Hammer, Iron, Lucky, Mace, Oak, Onyx, Pants, Pierce, Red, Rod, Rusty, Scout, Seven, Shield, Slash, Smith, Spike, Temple, Vault, Wall"
        ],
        "type": "list",
        "content": ""
      }
    ],
    "features": [
      {
        "list": [
          "You have advantage on saving throws against being poisoned, and you have resistance to poison damage.",
          "You don't need to eat, drink, or breathe.",
          "You are immune to disease.",
          "You don't need to sleep, and magic can't put you to sleep.",
          ""
        ],
        "title": "Constructed Resilience",
        "description": "You were created to have remarkable fortitude, represented by the following benefits:"
      },
      {
        "title": "Sentry's Rest",
        "description": "When you take a long rest, you must spend at least six hours in an inactive, motionless state, rather than sleeping. In this state, you appear inert, but it doesn't render you unconscious, and you can see and hear as normal."
      },
      {
        "list": [
          "You gain a +1 bonus to Armor Class.",
          "You can don only armor with which you have proficiency. To don armor other than a shield, you must incorporate it into your body over the course of 1 hour, during which you remain in contact with the armor. To doff armor, you must spend 1 hour removing it. You can rest while donning or doffing armor in this way.",
          "While you live, the armor incorporated into your body can't be removed against your will."
        ],
        "title": "Integrated Protection",
        "description": "Your body has built-in defensive layers, which can be enhanced with armor:"
      },
      {
        "title": "Specialized Design",
        "description": "You gain one skill proficiency and one tool proficiency of your choice."
      }
    ],
    "created_at": "2025-10-23T07:55:03.509+00:00",
    "key": "warforged",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "fc9026f1-c1d3-4321-8a4d-3b6e2978dccc",
    "name": "Water Genasi",
    "source": "Mordenkainen Presents: Monsters of the Multiverse",
    "description": "Water genasi are perfectly suited to life underwater and carry the power of the waves inside themselves.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/water_genasi/water_genasi.webp",
    "creature_type": "Humanoid",
    "size": "Small or Medium",
    "speed": "30 feet, Swim equal to your walking speed",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/water_genasi/water_genasi_main.png",
    "traits": [
      "Acid Resistance",
      "Amphibious",
      "Call to the Wave",
      "Darkvision"
    ],
    "details": [
      {
        "type": "description",
        "content": "Tracing their ancestry to the genies of the Elemental Planes, each genasi can tap into the power of one of the elements. Air, earth, fire, and water—these are the four pillars of the Material Plane and the four types of genasi. Some genasi are direct descendants of a genie, while others were born to non-genasi parents who lived near a place suffused by a genie's magic.\n\nA typical genasi has a life span of 120 years."
      }
    ],
    "features": [
      {
        "title": "Acid Resistance",
        "description": "You have resistance to acid damage."
      },
      {
        "title": "Amphibious",
        "description": "You breathe air and water."
      },
      {
        "title": "Call to the Wave",
        "description": "You know the acid splash cantrip. Starting at 3rd level, you can cast the create or destroy water spell with this trait. Starting at 5th level, you can also cast the water walk spell with this trait, without requiring a material component. Once you cast create or destroy water or water walk with this trait, you can't cast that spell with it again until you finish a long rest. You can also cast either of those spells using any spell slots you have of the appropriate level.\n\nIntelligence, Wisdom, or Charisma is your spellcasting ability for these spells when you cast them with this trait (choose when you select this race)."
      },
      {
        "title": "Darkvision",
        "description": "You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
      }
    ],
    "created_at": "2025-10-23T07:55:03.979+00:00",
    "key": "water_genasi",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "a6102b55-d10c-4db1-8961-fc796cd467e7",
    "name": "Yuan Ti",
    "source": "Mordenkainen Presents: Monsters of the Multiverse",
    "description": "Blessed with resistance to magical and poisonous effects by the rituals that created them, each of these yuan-ti manifests their serpentine heritage in a variety of ways.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/yuan_ti/yuan_ti.webp",
    "creature_type": "Humanoid",
    "size": "Small or Medium",
    "speed": "30 feet",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/yuan_ti/yuan_ti_main.png",
    "traits": [
      "Darkvision",
      "Magic Resistance",
      "Poison Resilience",
      "Serpentine Spellcasting"
    ],
    "details": [
      {
        "type": "description",
        "content": "Yuan-ti were originally humans who transformed themselves into serpent folk through ancient rituals. Most yuan-ti were corrupted into monsters by those rites, but some yuan-ti instead became a new people who mix characteristics of humans and snakes.\n\nBlessed with resistance to magical and poisonous effects by the rituals that created them, each of these yuan-ti manifests their serpentine heritage in a variety of ways: a forked tongue, snake eyes, a snakelike nose, or some other ophidian characteristic. However a yuan-ti looks, they have the power to pursue great good or evil in the multiverse."
      }
    ],
    "features": [
      {
        "title": "Darkvision",
        "description": "You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
      },
      {
        "title": "Magic Resistance",
        "description": "You have advantage on saving throws against spells."
      },
      {
        "title": "Poison Resilience",
        "description": "You have advantage on saving throws you make to avoid or end the poisoned condition on yourself. You also have resistance to poison damage."
      },
      {
        "title": "Serpentine Spellcasting",
        "description": "You know the poison spray cantrip. You can cast animal friendship an unlimited number of times with this trait, but you can target only snakes with it. Starting at 3rd level, you can also cast suggestion with this trait. Once you cast it, you can't do so again until you finish a long rest. You can also cast it using any spell slots you have of 2nd level or higher.\n\nIntelligence, Wisdom, or Charisma is your spellcasting ability for these spells when you cast them with this trait (choose when you select this race)."
      }
    ],
    "created_at": "2025-10-23T07:55:04.475+00:00",
    "key": "yuan-ti",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "31dc9048-8417-4891-933b-30104f794683",
    "name": "Eleginette",
    "source": "Kashlava's Collection of Tales",
    "description": "The Eleginette are living dolls of porcelain,  cotton, or silk. Their delicate frames moved could be move by gears or strings, but by fragments of ancient souls that whisper through every step. Neither fully mortal nor fully construct, they are beauty shaped by magic and haunted by memories.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/Eleginette/Eleginette.webp",
    "creature_type": "Celestial or Construct",
    "size": "You are Medium (around 5 feet to over 7 foot) or Small (3 feet to 4 feet). You choose the size. ",
    "speed": "30 feet",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/eleginette/eleginette_main.png",
    "traits": [
      "Strings of Falsehood",
      "Unrepairable",
      "Observant One's Dreams & Memories",
      "In Treads Woven Through Magic"
    ],
    "details": [
      {
        "type": "description",
        "content": "The Éléginette are living dolls crafted of porcelain, cotton, wood, or clockwork, animated by fragments of magical souls as the flickers of memories of new is born within them. They walk, speak, and feel as mortals do, though their existence is a fragile balance between artistry and spirit within their construct body. \n\nTheir voices carry a haunting resonance, as though many echoes speak through them at once. To the Éléginette, life is performance — some seek beauty and perfection that were given by their creator, others yearn to prove they are more than a vessel that was created by someone else. \n\nBut none are the same as each are created by different people with some having memories of some other induvial which form or create forward the personalities of the Éléginette, which even some Éléginette don't remember or able to access these memories, while some are able to. While some having none and having nothing at all to start their life ahead."
      }
    ],
    "features": [
      {
        "title": "Strings of Falsehood",
        "description": "You have Advantage on saving throws you make to avoid or end the Charmed or Frightened condition. Alongside you don’t need to sleep as you only need 6 hours of inactiveness to gain the effect of long rest, and you don't need to eat, drink, or breath."
      },
      {
        "title": "Unrepairable",
        "description": "Whenever you regain hit points, you only regain half of the healing. This only apply for healing alongside temporary hit point as your body is unable to repair itself as easily as other mortals."
      },
      {
        "list": [
          "Add +1d8 to all ability checks and saving throws.",
          "Add +1d4 to all attack rolls.",
          "Increase your Spell Save DC by +1.",
          "You gain Temporary hit point equal to your current level of d6 plus your current level of temporary hit point (Which any temporary hit point will drop to 0 after Observant One's Dreams & Memories drops)",
          "Whenever your hit point drop to 0, you are stabilize "
        ],
        "title": "Observant One's Dreams & Memories",
        "description": "As a bonus action, once per short rest, you may draw upon the fractured dreams and memories of the soul that fuels you, unlocking its full magical resonance. During this state, you cannot regain hit points by any means. For 1 minute, or until your hit points are reduced to 0, you gain following benefit:"
      },
      {
        "table": {
          "rows": [
            [
              "Trickster",
              "Proficiency in Sleight of Hand",
              "Dancing Light",
              "Grease"
            ],
            [
              "Electrical",
              "Proficiency in Arcana",
              "Shocking Grasp",
              "Detect Magic"
            ],
            [
              "Automates",
              "Proficiency in Investigation",
              "Mending",
              "Catapult"
            ],
            [
              "De Mirage",
              "Proficiency in Deception",
              "Minor Illusion",
              "Color Spray"
            ],
            [
              "Etat d'âme ",
              "Proficiency in Persuasion",
              "Message ",
              "False Life"
            ]
          ],
          "headers": [
            "Treads Woven",
            "Level 1\t(Proficiency)",
            "Level 3\t",
            "Level 5"
          ]
        },
        "title": "In Treads Woven Through Magic",
        "description": "You have proficiency in skills base upon the table.\n\nWhen you reach character levels 3 and 5, you learn a higher-level spell, as shown on the table. You always have that spell prepared. You can cast it once without a spell slot, and you regain the ability to cast it in that way when you finish a Long Rest. You can also cast the spell using any spell slots you have of the appropriate level."
      }
    ],
    "created_at": "2025-10-23T07:54:36.125+00:00",
    "key": "eleginette",
    "homebrew": true,
    "homebrew_id": ""
  },
  {
    "id": "3693f1c4-c33c-4138-aec8-a6df2026d2dc",
    "name": "Aarakocra",
    "source": "Mordenkainen Presents: Monsters of the Multiverse",
    "description": "A winged people who originated on the Elemental Plane of Air, aarakocra soar through the sky wherever they wander.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/aarakocra/aarakocra.webp",
    "creature_type": "Humanoid",
    "size": "Medium",
    "speed": "30 feet, Fly equal to your walking speed",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/aarakocra/aarakocra_main.png",
    "traits": [
      "Flight",
      "Talons",
      "Wind Caller"
    ],
    "details": [
      {
        "type": "description",
        "content": "A winged people who originated on the Elemental Plane of Air, aarakocra soar through the sky wherever they wander. The first aarakocra served the Wind Dukes of Aaqa—mighty beings of air—and were imbued with a measure of their masters' power over winds. Their descendants still command echoes of that power.\n\nFrom below, aarakocra look like large birds and thus are sometimes called birdfolk. Only when they roost on a branch or walk across the ground is their Humanoid nature clear. Standing upright, aarakocra are typically about 5 feet tall, and they have long, narrow legs that taper to sharp talons. Feathers cover their bodies—usually red, orange, yellow, brown, or gray. Their heads are also avian, often resembling those of parrots or eagles."
      }
    ],
    "features": [
      {
        "title": "Flight",
        "description": "Because of your wings, you have a flying speed equal to your walking speed. You can't use this flying speed if you're wearing medium or heavy armor."
      },
      {
        "title": "Talons",
        "description": "You have talons that you can use to make unarmed strikes. When you hit with them, the strike deals 1d6 + your Strength modifier slashing damage, instead of the bludgeoning damage normal for an unarmed strike."
      },
      {
        "title": "Wind Caller",
        "description": "Starting at 3rd level, you can cast the gust of wind spell with this trait, without requiring a material component. Once you cast the spell with this trait, you can't do so again until you finish a long rest. You can also cast the spell using any spell slots you have of 2nd level or higher.\n\nIntelligence, Wisdom, or Charisma is your spellcasting ability for when you cast gust of wind with this trait (choose when you select this race)."
      }
    ],
    "created_at": "2025-10-23T07:54:23.098+00:00",
    "key": "aarakocra",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "58abec19-70a2-42e4-9b40-7468e62d1bdf",
    "name": "Aasimar",
    "source": "Player's Handbook",
    "description": "Aasimar are mortals who carry a spark of the Upper Planes within their souls.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/aasimar/aasimar.webp",
    "creature_type": "Humanoid",
    "size": "Medium (about 4-7 feet tall) or Small (about 2-4 feet tall), chosen when you select this species",
    "speed": "30 feet.",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/aasimar/aasimar_main.webp",
    "traits": [
      "Celestial Resistance",
      "Darkvision",
      "Healing Hands",
      "Light Bearer",
      "Celestial Revelation"
    ],
    "details": [
      {
        "type": "description",
        "content": "The ancestors of aasimar trace their lineage to unions or blessings from celestial beings—angels, archons, and other spirits of the Upper Planes. Some stories claim the gods themselves shaped them as heralds of light, while others suggest that celestial power sometimes seeps into mortal bloodlines unbidden, carried across generations until it manifests in a child. Whatever their origin, aasimar walk among mortals as rare figures whose souls bear the reflection of the divine.\n\nAasimar resemble humans, yet their celestial heritage shines through in ways that cannot be mistaken. Their eyes may gleam with silver, gold, or radiant color; their voices often carry a resonance that seems too clear for the mortal world; their skin might hold a faint glow, as if brushed by starlight. Subtler still is the aura they project—an unseen weight of presence that others feel more than perceive. To some, this aura feels like warmth, safety, and the comfort of standing near a hearth. To others, it is like a calm silence before dawn, or the gentle awe of hearing a distant choir. Some aasimar radiate authority that demands respect, while others seem wrapped in serenity that soothes fear and quiets anger.\n\nThough not all aasimar understand the gift within them, their very presence marks them as touched by something beyond the mortal coil. For some, it is a blessing that inspires others to hope; for others, it is a burden that isolates them from those who cannot share the same light. Either way, they are reminders that the heavens watch the world, and sometimes choose to leave a trace of their glory within it."
      }
    ],
    "features": [
      {
        "title": "Celestial Resistance",
        "description": "You have Resistance to Necrotic damage and Radiant damage."
      },
      {
        "title": "Darkvision",
        "description": "You have Darkvision with a range of 60 feet."
      },
      {
        "title": "Healing Hands",
        "description": "As a Magic action, you touch a creature and roll a number of d4s equal to your Proficiency Bonus. The creature regains a number of Hit Points equal to the total rolled. Once you use this trait, you can't use it again until you finish a Long Rest."
      },
      {
        "title": "Light Bearer",
        "description": "You know the Light cantrip. Charisma is your spellcasting ability for it."
      },
      {
        "list": [
          "Heavenly Wings. Two spectral wings sprout from your back temporarily. Until the transformation ends, you have a Fly Speed equal to your Speed.",
          "Inner Radiance. Searing light temporarily radiates from your eyes and mouth. For the duration, you shed Bright Light in a 10-foot radius and Dim Light for an additional 10 feet, and at the end of each of your turns, each creature within 10 feet of you takes Radiant damage equal to your Proficiency Bonus.",
          "Necrotic Shroud. Your eyes briefly become pools of darkness, and flightless wings sprout from your back temporarily. Creatures other than your allies within 10 feet of you must succeed on a Charisma saving throw (DC 8 plus your Charisma modifier and Proficiency Bonus) or have the Frightened condition until the end of your next turn."
        ],
        "title": "Celestial Revelation",
        "description": "When you reach character level 3, you can transform as a Bonus Action using one of the options below (choose the option each time you transform). The transformation lasts for 1 minute or until you end it (no action required). Once you transform, you can’t do so again until you finish a Long Rest.\n\nOnce on each of your turns before the transformation ends, you can deal extra damage to one target when you deal damage to it with an attack or a spell. The extra damage equals your Proficiency Bonus, and the extra damage’s type is either Necrotic for Necrotic Shroud or Radiant for Heavenly Wings and Inner Radiance.\n\nHere are the transformation options:"
      }
    ],
    "created_at": "2025-10-23T07:54:26.113+00:00",
    "key": "aasimar",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "b21593ed-bd81-424b-9954-f0c84214ea43",
    "name": "Air Genasi",
    "source": "Mordenkainen Presents: Monsters of the Multiverse",
    "description": "Embodying many of the airy traits of their otherworldly ancestors, air genasi can draw upon their connection to the winds.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/air_genasi/air_genasi.webp",
    "creature_type": "Humanoid",
    "size": "Small or Medium",
    "speed": "35 feet",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/air_genasi/air_genasi_main.png",
    "traits": [
      "Darkvision",
      "Unending Breath",
      "Lightning Resistance",
      "Mingle with the Wind"
    ],
    "details": [
      {
        "type": "description",
        "content": "Tracing their ancestry to the genies of the Elemental Planes, each genasi can tap into the power of one of the elements. Air, earth, fire, and water—these are the four pillars of the Material Plane and the four types of genasi. Some genasi are direct descendants of a genie, while others were born to non-genasi parents who lived near a place suffused by a genie's magic.\n\nA typical genasi has a life span of 120 years."
      }
    ],
    "features": [
      {
        "title": "Darkvision",
        "description": "You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
      },
      {
        "title": "Unending Breath",
        "description": "You can hold your breath indefinitely while you're not incapacitated."
      },
      {
        "title": "Lightning Resistance",
        "description": "You have resistance to lightning damage."
      },
      {
        "title": "Mingle with the Wind",
        "description": "You know the shocking grasp cantrip. Starting at 3rd level, you can cast the feather fall spell with this trait, without requiring a material component. Starting 5th level, you can also cast the levitate spell with this trait, without requiring a material component. Once you cast feather fall or levitate with this trait, you can't cast that spell with it again until you finish a long rest. You can also cast either of those spells using any spell slots you have of the appropriate level.\n\nIntelligence, Wisdom, or Charisma is your spellcasting ability for these spells when you cast them with this trait (choose when you select this race)."
      }
    ],
    "created_at": "2025-10-23T07:54:27.301+00:00",
    "key": "air_genasi",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "4372c842-3bc6-469c-9746-0aa5f214ac8b",
    "name": "Astral Elf",
    "source": "Astral Adventurer’s Guide",
    "description": "Groups of elves ventured from the Feywild to the Astral Plane to be closer to their gods. Life in the Silver Void has imbued their souls with a spark of divine light.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/astral_elf/astral_elf.webp",
    "creature_type": "Humanoid",
    "size": "Medium (about 5 to over 6 feet tall)",
    "speed": "30 feet.",
    "asi": "+2 Any other, +1 to Any other",
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/astral_elf/astral_elf_main.webp",
    "traits": [
      "Astral Fire",
      "Darkvision",
      "Fey Ancestry",
      "Keen Senses",
      "Starlight Step",
      "Astral Trance"
    ],
    "details": [
      {
        "type": "description",
        "content": "Long ago, groups of elves ventured from the Feywild to the Astral Plane to be closer to their gods. Life in the Silver Void has imbued their souls with a spark of divine light. That light manifests as a starry gleam in an astral elf’s eyes.\n\nBecause nothing ages on the Astral Plane, astral elves who inhabit that plane can be very old, and their longevity gives them an unusual perspective on the passage of time. Some are prone to melancholy, while others might display an absence of feeling. Many look for creative ways to occupy themselves. Whether they choose to live in quiet contemplation or strike out to explore the reaches of the multiverse, astral elves tend to see things through the lens of time as having little or no meaning to them. Astral elves who don’t dwell on the Astral Plane can live to be more than 750 years old."
      }
    ],
    "features": [
      {
        "title": "Astral Fire",
        "description": "You know one of the following cantrips of your choice: dancing lights, light, or sacred flame. Intelligence, Wisdom, or Charisma is your spellcasting ability for it (choose when you select this race)."
      },
      {
        "title": "Darkvision",
        "description": "You can see in dim light within 60 feet of yourself as if it were bright light, and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
      },
      {
        "title": "Fey Ancestry",
        "description": "You have advantage on saving throws you make to avoid or end the charmed condition on yourself."
      },
      {
        "title": "Keen Senses",
        "description": "You have proficiency in the Perception skill."
      },
      {
        "title": "Starlight Step",
        "description": "As a bonus action, you can magically teleport up to 30 feet to an unoccupied space you can see. You can use this trait a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
      },
      {
        "title": "Astral Trance",
        "description": "You don’t need to sleep, and magic can’t put you to sleep. You can finish a long rest in 4 hours if you spend those hours in a trancelike meditation, during which you remain conscious.\n\nWhenever you finish this trance, you gain proficiency in one skill of your choice and with one weapon or tool of your choice, selected from the Player’s Handbook. You mystically acquire these proficiencies by drawing them from shared elven memory and the experiences of entities on the Astral Plane, and you retain them until you finish your next long rest."
      }
    ],
    "created_at": "2025-10-23T07:54:28.814+00:00",
    "key": "astral_elf",
    "homebrew": false,
    "homebrew_id": ""
  },
  {
    "id": "943f3fa4-f13f-4bf3-9125-5b516b44cd01",
    "name": "Autognome",
    "source": "Astral Adventurer's Guide",
    "description": "Sometimes, because of a malfunction or a unique circumstance, an autognome becomes separated from its creator and strikes out on its own.",
    "image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/autognome/autognome.webp",
    "creature_type": "Construct",
    "size": "Small",
    "speed": "30 feet",
    "asi": null,
    "main_image": "https://019a0f6bb5a27dc5b6ab32a19a8ad5d6.phanneldeliver.my.id/races/autognome/autognome_main.jpg",
    "traits": [
      "Armored Casing",
      "Built for Success",
      "Healing Machine",
      "Mechanical Nature",
      "Sentry’s Rest",
      "Specialized Design"
    ],
    "details": [
      {
        "type": "description",
        "content": "Autognomes are mechanical beings built by rock gnomes. Sometimes, because of a malfunction or a unique circumstance, an autognome becomes separated from its creator and strikes out on its own.\n\nAn autognome bears a resemblance to its creator, and most autognomes are programmed to speak and understand Gnomish. The internal components used in an autognome's manufacture can vary wildly; one autognome might have an actual beating heart in its chest cavity, while another might be powered by stardust or intricate clockwork gears.\n\nRoll on the Autognome History table or choose an entry that you like to identify what event set you on the path to adventure. If nothing on the table appeals to you, work with your DM to create an origin story for your character.\n\nLike gnomes, autognomes can live for centuries, typically up to 500 years."
      },
      {
        "type": "description",
        "content": "Autognome History"
      },
      {
        "type": "table",
        "table": {
          "rows": [
            [
              "1",
              "Your creator gave you autonomy and urged you to follow your dreams."
            ],
            [
              "2",
              "Your creator died, leaving you to fend for yourself."
            ],
            [
              "3",
              "A glitch caused you to forget your original programming. You don't remember who made you or where you came from."
            ],
            [
              "4",
              "You didn't like how you were being treated by your creator, so you ran away from home."
            ],
            [
              "5",
              "You were built to complete a special mission."
            ],
            [
              "6",
              "You felt trapped in the role for which you were built and abandoned your creator, determined to find a greater purpose."
            ]
          ],
          "headers": [
            "d6",
            "Story"
          ]
        },
        "content": ""
      }
    ],
    "features": [
      {
        "title": "Armored Casing",
        "description": "You are encased in thin metal or some other durable material. While you aren't wearing armor, your base Armor Class is 13 + your Dexterity modifier."
      },
      {
        "title": "Built for Success",
        "description": "You can add a d4 to one attack roll, ability check, or saving throw you make, and you can do so after seeing the d20 roll but before the effects of the roll are resolved. You can use this trait a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
      },
      {
        "title": "Healing Machine",
        "description": "If the mending spell is cast on you, you can spend a Hit Die, roll it, and regain a number of hit points equal to the roll plus your Constitution modifier (minimum of 1 hit point).\n\nIn addition, your creator designed you to benefit from several spells that preserve life but that normally don't affect Constructs: cure wounds, healing word, mass cure wounds, mass healing word, and spare the dying."
      },
      {
        "title": "Mechanical Nature",
        "description": "You have resistance to poison damage and immunity to disease, and you have advantage on saving throws against being paralyzed or poisoned. You don't need to eat, drink, or breathe."
      },
      {
        "title": "Sentry’s Rest",
        "description": "When you take a long rest, you spend at least 6 hours in an inactive, motionless state, instead of sleeping. In this state, you appear inert, but you remain conscious."
      },
      {
        "title": "Specialized Design",
        "description": "You gain two tool proficiencies of your choice, selected from the Player's Handbook."
      }
    ],
    "created_at": "2025-10-23T07:54:29.648+00:00",
    "key": "autognome",
    "homebrew": false,
    "homebrew_id": ""
  }
]